[{"fullName":"","postDate":"","reviewTitle":"","postReview":"","starRating":"","averageRating":"4.5 "},{"fullName":"700scottf","postDate":"June 29, 2019","reviewTitle":"A bit underwhelming...","postReview":"The grounds are beautiful and the interior is pleasing, the service was sub-par and the food lacked much flavor and creativity. Over-all, not the dining experience we were expecting!","starRating":"30","averageRating":0},{"fullName":"Maya S","postDate":"June 4, 2019","reviewTitle":"Trying to be too fancy","postReview":"The food was good, but it felt like they were trying a little too hard. The vegan entre, a polenta dish, was one of the strangest things I have ever eaten. Portions are small but I guess that's to be expected at a very fancy...More","starRating":"40","averageRating":0},{"fullName":"LAFAMILLEG11231","postDate":"June 1, 2019","reviewTitle":"The Tavern","postReview":"We ate at the Tavern at American Bounty this time. Was ok, but since we've eaten at American Bounty, Bocuse and Caterina we were a bit disappointed. It was just average.","starRating":"30","averageRating":0},{"fullName":"Joe B","postDate":"May 22, 2019","reviewTitle":"Fun and flavorful","postReview":"Probably my 4th time coming to the culinary restaurants I'm never disappointed. The food is cooked to perfection, flavor combinations are sublime. The experience is part of the students growth process, as you get a chance to talk with near to graduation students as they...More","starRating":"50","averageRating":0},{"fullName":"DianneWheatley","postDate":"May 20, 2019","reviewTitle":"One of Seven Restaurants At The Culinary Institute of America","postReview":"We understand that American Bounty is the second highest experience at CIA. Come for the food but also to see the enchanting campus overlooking the Hudson River. And do enjoy and encourage the student chefs. Two of our team of servers were from Florida...even the...More","starRating":"50","averageRating":0},{"fullName":"Gypsgris","postDate":"May 17, 2019","reviewTitle":"Excellent lunch prix fixe","postReview":"Once in a while the American Bounty at the CIA offers prix fixe lunches. Our friends reminded us of this and so the four of us went. We were so glad that we did! The food was excellent from the appetizers to the main dishes...More","starRating":"50","averageRating":0},{"fullName":"Gretchen_Friend","postDate":"May 15, 2019","reviewTitle":"Future chefs?","postReview":"We had long wanted to visit one of the CIA restaurants and chose the American Bounty. The service was excellent, the setting very pleasant and the noise level at quiet, thankfully. We found the menu a little predictable, as though the students need to learn...More","starRating":"40","averageRating":0},{"fullName":"bernardftaylor","postDate":"May 7, 2019","reviewTitle":"Seriously not great","postReview":"We couldn't get reservations in the main dining room so we ended up going to the Tavern at American Bounty; I expected more. The burger had great meat but the bread was stale and the sauce they put on the burger actually masked a lot...More","starRating":"20","averageRating":0},{"fullName":"BizMark7","postDate":"April 27, 2019","reviewTitle":"Great food great service","postReview":"We had lunch there today. Outstanding!!! WOW !! Merry son and I had a great experience and would go back again when back in town","starRating":"50","averageRating":0},{"fullName":"jbkster","postDate":"April 14, 2019","reviewTitle":"Very good for a student-run operation","postReview":"I dined with 10 other people participating in a CIA bootcamp. We had a wonderful experience. Service staff and line cooks are all CIA students near the end of their second school year. They were very good. The kitchen could be a bit better organized...More","starRating":"40","averageRating":0},{"fullName":"TeeoffS","postDate":"September 28, 2018","reviewTitle":"Great Burgers & Fish Tocos","postReview":"Sept 2018 - great place for a quick bite. Plenty of seating and nice Bar area that seats maybe 10 or less. Sat at the Bar with my two friends and ordered the Fish Tocos and a Burger. Both dishes were great tasting. The Fish...More","starRating":"40","averageRating":0},{"fullName":"Leigh B","postDate":"September 22, 2018","reviewTitle":"A nice dinner","postReview":"This was a nice experience. The food was very good. The rolls were to die for. We could have just kept eating them. For a college it was pretty impressive.","starRating":"50","averageRating":0},{"fullName":"ReggieCat","postDate":"September 19, 2018","reviewTitle":"Dinner","postReview":"Reservations are a must. Leave time to appreciate the impressive entrance with fountains,gardens and benches. Dinner was delicious and the presentation was exceptional. The service, however still needs more practice.","starRating":"40","averageRating":0},{"fullName":"grandmere11","postDate":"September 13, 2018","reviewTitle":"Interesting experience.","postReview":"This is a learning experience for the Culinary students & as such do not expect professional service.Student waiter spoke softly & we had to ask him to repeat himself often.His explanation of the menu choice turned out not to be accurate.Water glass sat empty .Coffee...More","starRating":"30","averageRating":0},{"fullName":"NJgirlonthego","postDate":"September 10, 2018","reviewTitle":"Great experience","postReview":"We went at lunchtime but the menu is more of a dinner menu. We had a nice glass od dry reisling. Then we split in order if raw oysters and k Heirloom tomato and bread salad. Oops I forgot to menu the Parkerhouse rolls; amazing....More","starRating":"50","averageRating":0},{"fullName":"gourmand47","postDate":"September 7, 2018","reviewTitle":"More than a restaurant, it is an experience!","postReview":"It was our Anniversary and we decided to do something special and the American Bounty is special. You must have a reservation and we were seated at the right time. A table for two near the kitchen which is behind glass so you can see...More","starRating":"50","averageRating":0},{"fullName":"foodlovergirlny","postDate":"August 31, 2018","reviewTitle":"Great American restaurnt","postReview":"During our fun and delicious visit to The Culinary Institute of America, we went to have lunch at this restaurant. We got a table by the window, close to their kitchen. When I tried to peak at the kitchen from afar, the Maître d’Instructor came...More","starRating":"40","averageRating":0},{"fullName":"Lisa W","postDate":"August 25, 2018","reviewTitle":"Creative food and decent service","postReview":"We had been to the CIA many times in the 1980s and 1990s but it had been about 20 years since we were here for a meal. Reservations are really needed as there was a huge line waiting to get in right after we were...More","starRating":"50","averageRating":0},{"fullName":"Jeshultz","postDate":"August 6, 2018","reviewTitle":"Top notch meal and service","postReview":"Our meal was excellent, and the service top notch. We must have been luck to have a very hard-working student server. The menu selection had plenty of variety, and what we ordered was excellent. We had some marginal experiences at other CIA restaurants, but this...More","starRating":"50","averageRating":0},{"fullName":"Confused_ExpatHanoi","postDate":"July 25, 2018","reviewTitle":"gut wrenching meal","postReview":"Though we had heard great things about the school nearly everyone at my table left with their expectations shattered. Though we expected there to be some mistakes in the service at the school we had no idea it would be this bad. Though our waiter...More","starRating":"20","averageRating":0},{"fullName":"175ritae","postDate":"July 24, 2018","reviewTitle":"Fabulous meal and experience","postReview":"Lunch at American Bounty was one of my best ever. Menu selection was impressive. Lamb was superbly prepared. Recommended wine was just right. Service was wonderful. Noisy party next to me was the only downside and that wasn't American Bounty's fault.","starRating":"50","averageRating":0},{"fullName":"X6263DHcarolynb","postDate":"July 18, 2018","reviewTitle":"Wonderful experience especially when paired with the tour","postReview":"Reading a few negative reviews here I am rather surprised since we could not have had a better experience. We took our Grandson on the tour of the school (led by students) first. If you do this, the tours are at 4pm and must be...More","starRating":"50","averageRating":0},{"fullName":"meyerw2017","postDate":"July 10, 2018","reviewTitle":"How to treat visitors from Northern CA","postReview":"Two New Yorkers took two adults from Marin County CA with their two teen agers to lunch at American Bounty. The Californians were extremely pleased with the food, service and general ambience. American Bounty was comparable to the fine restaurants of the San Francisco Bay...More","starRating":"50","averageRating":0},{"fullName":"David S","postDate":"July 7, 2018","reviewTitle":"I wish we lived closer.","postReview":"As far as I am concerned this is a destination restaurant and well worth the trip. This was our second visit -- the first was about 8 years ago. Our meal was great. The menu was very interesting. Our cocktails were good. The wine list...More","starRating":"50","averageRating":0},{"fullName":"DannyD81","postDate":"July 1, 2018","reviewTitle":"Wonderful Dinner!","postReview":"My wife, son, and I dined here this weekend and enjoyed every aspect of our dinner. First, and foremost, the staff is overwhelmingly pleasant and accommodating. Secondly, the food is magnificent! They even allowed us to order off the Tavern menu so that we could...More","starRating":"50","averageRating":0},{"fullName":"Tom M","postDate":"June 30, 2018","reviewTitle":"Worth it and wonderful","postReview":"We had the Steelhead Wellington and also Pike. The food was wonderful. The hospitality was exceptional. The Parker House rolls are a delightful treat. TripAdvisor","starRating":"50","averageRating":0},{"fullName":"Fauxqui","postDate":"June 27, 2018","reviewTitle":"Fabulous meal and experience","postReview":"From the octopus served with a black rice and mussels to the complementary dessert this was a great meal. The staff (all students) was attentive and knowledgeable. My wife had the pike which was cooked to perfection. She felt that it could have been served...More","starRating":"50","averageRating":0},{"fullName":"drcrushser","postDate":"June 27, 2018","reviewTitle":"Far Below Expectations","postReview":"I rarely give bad reviews, but our experience at American Bounty was such a dissapointment I feel compelled to share it. My husband and I had been looking forward to dinner at the CIA for at least a month and we were expecting a high...More","starRating":"20","averageRating":0},{"fullName":"Asaf S","postDate":"June 25, 2018","reviewTitle":"Great Food and Great Energy","postReview":"This is our second time at the CIA and second time at this restaurant. As always the decor is amazing, the food is great and the students are the best. For the quality of experience reasonably priced. Remember that they add 20% for service (no...More","starRating":"50","averageRating":0},{"fullName":"route50guy","postDate":"June 23, 2018","reviewTitle":"run away as fast as you can bring your own spoon","postReview":"We thought this would be fun; not. We knew that the staff and cooks were students and that things would be uneven; worse than that. The kitchen staff knows how to say \"yes Chef\" but that is about it. The fish dish was not cooked...More","starRating":"10","averageRating":0},{"fullName":"retiredandtraveling5","postDate":"May 28, 2018","reviewTitle":"Fresh, Carefully Prepared, and Attentively Served","postReview":"This is one of the restaurants at the CIA (Culinary Institute of America). From the freshly baked bread to flavorful appetizers to the creative presentation of entrees, you won’t be disappointed. Watching the baked, salt encrusted fish carefully filleted table side was a treat as...More","starRating":"50","averageRating":0},{"fullName":"Samantha F","postDate":"May 17, 2018","reviewTitle":"The Tavern at American Bounty","postReview":"This time we actually ate at the Tavern. The homemade chips were VERY good, even though the beer cheese dip was not served hot and was a little thick. The burgers were HUGE! Nowhere does it indicate that you are getting a half-pound burger. They...More","starRating":"30","averageRating":0},{"fullName":"DMSMD64","postDate":"April 30, 2018","reviewTitle":"Wonderful Experience","postReview":"First and foremost you need to keep in mind this is a classroom. If everything were already learned and perfected then they wouldn’t be students. We happened to visit for lunch, by coincidence, on the first day of the rotation. We were dinging as guests...More","starRating":"40","averageRating":0},{"fullName":"KimberH0422","postDate":"April 21, 2018","reviewTitle":"Delicious!","postReview":"We decided to have lunch at the CIA before heading back home to PA. We had dinner there the night before (at the Post Road Brew House.. excellent!). When we arrived we had the option of The Tavern or the American Bounty and were given...More","starRating":"50","averageRating":0},{"fullName":"FredFingerboard","postDate":"April 13, 2018","reviewTitle":"Bland and uninspired","postReview":"Disappointed. We expected good food and knowledgeable service. We received neither. Server didn’t know the menu. Wine expert didn’t know the wines. For a school that supposed to teach the basics of cooking and serving — We were surprised at the lack of knowledge.","starRating":"30","averageRating":0},{"fullName":"novagirl11kd","postDate":"April 8, 2018","reviewTitle":"just ok","postReview":"we weren't crazy about the food, but it was a fun experience. Mostly, the meal was not memorable but I do remember that the rolls were great!","starRating":"20","averageRating":0},{"fullName":"LAFAMILLEG11231","postDate":"March 24, 2018","reviewTitle":"Excellent","postReview":"Great lunch from head to toe. Service, attention, food, cleanliness an A+ Also the HVRW menu was fantastic.","starRating":"50","averageRating":0},{"fullName":"aquasun25","postDate":"March 21, 2018","reviewTitle":"American bounty lives up to its name","postReview":"The food at this restaurant is well prepared and sourced locally. The lunch was quite delicious and many great options. I had the duck confit salad and also tried a selection of the cheeses. For dessert try the molten chocolate lava cake.","starRating":"50","averageRating":0},{"fullName":"Brad M","postDate":"March 5, 2018","reviewTitle":"Wow, wow, wow!!!","postReview":"I think the title says it all. Few times have a left a restaurant being completely satisfied. I am usually pretty good at finding something to criticize, but not at American Bounty. I was lucky enough to eat here while I was up for a...More","starRating":"50","averageRating":0},{"fullName":"Samantha F","postDate":"March 5, 2018","reviewTitle":"Great Food, Beautiful Atmosphere","postReview":"The atmosphere at American Bounty is beautiful. The dining room is broken out in sections which makes for a quieter dining experience. The windows showing the small courtyard let in amazing light and make dining a truly peaceful experience. The service and food are prepared...More","starRating":"50","averageRating":0},{"fullName":"kathleen e","postDate":"February 22, 2018","reviewTitle":"Fabulous !","postReview":"A wonderful beautiful meal cooked by the students and served by them as well. Its a very cool place to eat and see.","starRating":"50","averageRating":0},{"fullName":"tjkm","postDate":"January 30, 2018","reviewTitle":"Amazing Lunch","postReview":"After touring the CIA we had the wonderful experience of dining at this restaurant. This was the first time my kids had experienced this type of service and food. They throughly enjoyed the experience. Our group was served a three course meal with bread. The...More","starRating":"50","averageRating":0},{"fullName":"jenniferdQ3438XD","postDate":"January 5, 2018","reviewTitle":"Culinary Institute of America","postReview":"American Bounty is one of several restaurants the CIA opens to the public to enjoy. All of the restaurants are run and staffed by the students. The students are also the chefs and the menu changes every few months with the seasons. My husband and...More","starRating":"50","averageRating":0},{"fullName":"beemanWinchester","postDate":"December 30, 2017","reviewTitle":"Food is fantastic","postReview":"We went with high expectations and the food did not disappoint us. For the most part the service was great I would rate it a 4. Our server I don't think understood us very well. It did not detract from our meal or experience. We...More","starRating":"50","averageRating":0},{"fullName":"Peter F","postDate":"December 28, 2017","reviewTitle":"Fine Amrerican Dining","postReview":"My friend wanted to do something special for her 60th birthday so she reservations at American Bounty. We had an excellent dining experience. My only complaint was we had to be there at noon for lunch and would have preferred a later slot. Nevertheless we...More","starRating":"50","averageRating":0},{"fullName":"NWRob","postDate":"November 30, 2017","reviewTitle":"OMG","postReview":"What a fabulous meal. Finally, I got to eat at CIA with reservations at American Bounty. This is their up scale very comfortable option. To begin, they focus on American wines, especially local wines. We had a bottle of very crisp Sauvignon Blanca from the...More","starRating":"50","averageRating":0},{"fullName":"Dan0001","postDate":"November 17, 2017","reviewTitle":"American Bounty Bistro","postReview":"We ate at the bistro or pub that is part of the American Bounty Restaurant. I very much enjoyed everything about the meal. The food was on point and the service was excellent. I would venture back to CIA to any other restaurants to have...More","starRating":"40","averageRating":0},{"fullName":"Ernest O","postDate":"November 13, 2017","reviewTitle":"American Cuisine at the Culinary Institute of America","postReview":"We were in the Hyde Park area for several days, so we decided to enjoy the three restaurants at the Culinary Institute. On our final night, dinner was at the American Bounty Restaurant. Their menus are based on local seasonal ingredients. The atmosphere in the...More","starRating":"50","averageRating":0},{"fullName":"Tom1021","postDate":"November 12, 2017","reviewTitle":"Great Meal!","postReview":"Five of us had lunch here - three adults and two teenagers. Each of us loved our meal! I had the duck confit; it was delicious! The duck leg was crispy and tasty - my grandson was afraid I was going to eat the bone...More","starRating":"50","averageRating":0},{"fullName":"IIbeach1","postDate":"November 7, 2017","reviewTitle":"Not As Good As Prior Visits","postReview":"We went for the \"Restaurant Week\" special menu, which as it turned out, was not so special. I had the braised oxtail appetizer and my partner had the sweetbreads. Mine had a great taste but too much fat. She loved hers. My entree was the...More","starRating":"30","averageRating":0},{"fullName":"bradbeebe52","postDate":"October 31, 2017","reviewTitle":"The CIA is a fantastic place","postReview":"We were at the Post Road Brew House (not an option from the drop down). Reservation made on Open Table. The students are incredibly passionate and focused. They have such incredible respect for the ingredients and preparation. Something as simple as tomato soup. You've never...More","starRating":"50","averageRating":0},{"fullName":"JulesVerne1","postDate":"October 23, 2017","reviewTitle":"CIA keeps up its high standards","postReview":"I last ate here more than 20 years ago and was delighted to see how high the standard remains. A pork belly appetizer - braised just right and unctuous. Halibut for a main, nicely cooked over greens, really good reduction sauce. Well chosen and affordable...More","starRating":"50","averageRating":0},{"fullName":"XSki007","postDate":"October 20, 2017","reviewTitle":"American Bounty Tavern","postReview":"We tried 2 weeks in advance, however reservations on a Saturday were not available. The Tavern is a great alternative, and it's walk-in. A limited, smaller menu, however everything is done well and it is a very cozy room with a great bar. Our barperson...More","starRating":"50","averageRating":0},{"fullName":"worldtravelerT1820IO","postDate":"October 1, 2017","reviewTitle":"It's hard to always be perfect","postReview":"We went to celebrate my birthday with a lunch before heading to a football game. The grounds are magnificent. The restaurant is nice with nice atmosphere. Our luck was that it was our servers first day and she mistakenly put the wrong order in for...More","starRating":"30","averageRating":0},{"fullName":"corptool","postDate":"September 26, 2017","reviewTitle":"Wanted to Like it More Than I Did","postReview":"We were all looking forward to this dinner and all a bit disappointed. The restaurant is nicely decorated, but none of us could see the kitchen window from our table. Our server was friendly, and I realize that she was a student in-training, but the...More","starRating":"30","averageRating":0},{"fullName":"Kathy Z","postDate":"September 22, 2017","reviewTitle":"quick bit without reservations","postReview":"We came to the CIA for a tour of the college and stopped at the Tavern for dinner. The restaurant is located in the main campus building and does not require reservations. The restaurants on campus are staffed by students. I think the ones working...More","starRating":"30","averageRating":0},{"fullName":"Iris R","postDate":"September 20, 2017","reviewTitle":"A fun visit","postReview":"The food was great! The soup needs a bit of salt but every thing else was great. The waiter was polite and attentive.","starRating":"40","averageRating":0},{"fullName":"967maeganh","postDate":"September 18, 2017","reviewTitle":"Wonderful food","postReview":"My parents are, well, not accustomed to anything that they weren't raised on. Needless to say, they let me order 3 apps for our table while waiting on my daughter to get out of class at the CIA. We had the Parker House rolls with...More","starRating":"40","averageRating":0},{"fullName":"TeeoffS","postDate":"September 12, 2017","reviewTitle":"Great Place To Dine","postReview":"We came here for a bite to eat after the 2017 Hudson Valley Wine Fest on Saturday and sat at the bar since we could not get a table. The service was quick and the Bartender was great. I ordered The Tavern Burger with beacon,...More","starRating":"40","averageRating":0},{"fullName":"JesstheFoodie","postDate":"September 12, 2017","reviewTitle":"Great menu/value for lunch","postReview":"We enjoyed our lunch at American Bounty during our visit to Hyde Park. We were promptly seated at our appointment time. The wait staff was friendly and attentive. The complementary bread was freshly out of the oven. Both appetizers (Pork Belly & Bourbon-Maple Cured Salmon)...More","starRating":"40","averageRating":0},{"fullName":"dwroesekejr","postDate":"September 9, 2017","reviewTitle":"Excellent food served with great atmosphere","postReview":"Delicious food that you can watch the students prep while waiting for yours. Service needs some attention. Price point is on the higher end but worth it. For a cheaper experience go before 6:30 to the adjacent Tavern.","starRating":"40","averageRating":0},{"fullName":"Angela F","postDate":"September 7, 2017","reviewTitle":"Beautiful Restaurant and Grounds","postReview":"The food is delicious and well delivered by the students. The atmosphere is beautiful with a view of the court yard.","starRating":"50","averageRating":0},{"fullName":"carrieporter399","postDate":"September 6, 2017","reviewTitle":"Memorable","postReview":"Great Anniversary Dinner. The venison was cooked perfectly. The student staff was professional and personable.","starRating":"40","averageRating":0},{"fullName":"DT5760","postDate":"August 30, 2017","reviewTitle":"Learning can result in GOOD food","postReview":"This restaurant is part of the Culinary Institute of America. This restaurant is part of the learning process of this school. If the dinner we had there recently is a sample of what these students are learning, then I think they are very successful. We...More","starRating":"50","averageRating":0},{"fullName":"brianmZ9243TR","postDate":"July 21, 2017","reviewTitle":"Great student run restaurant","postReview":"My favorite restaurant at the cia. Had the heirloom tomato app, short rib entree. Please remember these are student run restaurants, your visit may be on their first day in that restaurant.Which means the entire staff is new. Please be patient and enjoy!","starRating":"40","averageRating":0},{"fullName":"Don51644","postDate":"July 19, 2017","reviewTitle":"Great","postReview":"Beautiful Campus,beautiful restaurant,fabulous food & great service what's left to say! This is a do not miss experience imaginative creative menu,beautiful setting & great service. A definite must if you are in or near Hyde Park please indulge yourself. We had great service & suggestions...More","starRating":"50","averageRating":0},{"fullName":"Andres72423","postDate":"July 15, 2017","reviewTitle":"Lunch","postReview":"Definitely enjoyed our lunch at this restaurant. We recommend you have reservations because it can be difficult to get in. The staff immediately checked us in and we were seated and ready to order. The ambiance at this place is great, perfect lighting and space...More","starRating":"40","averageRating":0},{"fullName":"Rob303631","postDate":"July 14, 2017","reviewTitle":"Worth a visit!","postReview":"I had here one of the best dinners I had in America in the last couple of years. If you tolerate some service imperfections (sometimes even amusing, like a waiter who was struggling to open a bottle of sparkling wine) you can have here a...More","starRating":"40","averageRating":0},{"fullName":"rustypuppy25","postDate":"July 3, 2017","reviewTitle":"The ultimate dinner experience. Presentation is of the utmost! Food is excusite!","postReview":"What a wonderful experience it was. Never realized the extent the chefs go to make your dinner experience spectactular. It is a bit pricey, but you really get your money's worth when you experience all the different tastes and presentations you experience.","starRating":"50","averageRating":0},{"fullName":"227karenl","postDate":"June 28, 2017","reviewTitle":"Students on parade","postReview":"At the Culinary Institute, this restaurant is a place for students to practice preparing and serving meals. Hooray for them. The food was above average but not a 5-star experience. The wine list was all American wines, mostly from New York State. The Traminette and...More","starRating":"40","averageRating":0},{"fullName":"WestchesterP2","postDate":"June 27, 2017","reviewTitle":"Beautiful spot and delicious, creative food.","postReview":"Brought friends to American Bounty for lunch. They had never been to the CIA. The food was delicious. Service was top notch. The waiter was helpful with all our menu questions. The creative selection of ingredients were wonderful. The cedar ice cream was outstanding! The...More","starRating":"50","averageRating":0},{"fullName":"markd273","postDate":"June 21, 2017","reviewTitle":"adventurous and delightful food","postReview":"Our second time here, and first as a couple, and the restaurant continues to surprise and delight. Every dish had touches that stood out--flower buds in salads, fresh locally sourced meats, contrasting textures. We did not find portions to be small as other reviewers have...More","starRating":"50","averageRating":0},{"fullName":"Larry M","postDate":"June 17, 2017","reviewTitle":"Still good for our second visit","postReview":"This is our second time eating here, and fourth time visiting the CIA. Food was very good and all the ingredients on the plate seem to work well together for an attractive presentation and an interesting taste profile. Service was friendly and attentive, and our...More","starRating":"40","averageRating":0},{"fullName":"laurib16","postDate":"May 21, 2017","reviewTitle":"Tiny portions and overpriced","postReview":"I have been here 3 or 4 times over the years and have also eaten at the other 2 restaurants. It cost the two of us $183 last night. This was for 2 very small appetizers, 2 main courses, 2 soups, 2 desserts and we...More","starRating":"30","averageRating":0},{"fullName":"Elizabeth H","postDate":"May 14, 2017","reviewTitle":"Just OK","postReview":"I really was hoping for something amazing, given the reputation of this restaurant, but found it was just OK, and the food was somewhat uneven. The best thing was actually the appetizer, which was brought as a treat from the chef - it was a...More","starRating":"30","averageRating":0},{"fullName":"Spencer M","postDate":"May 10, 2017","reviewTitle":"CIA - Watch Your Taste Buds","postReview":"The Culinary Institute of America (CIA) is one of my favorite destinations in the Hudson Valley. A real gem for foodies. Built on a Monastery and having gone through many other transformations the CIA is a must visit for lunch or dinner. The American Bounty...More","starRating":"50","averageRating":0},{"fullName":"jmbc04","postDate":"May 9, 2017","reviewTitle":"Excellent Service but Tiny Portions","postReview":"Great place for special occasions, however be prepared for very small portions. The prices are high but since its a school, I feel that I am helping to support the programs offered. Gratuities are not allowed but there is a 17% charge added that goes...More","starRating":"40","averageRating":0},{"fullName":"princetonarea","postDate":"May 1, 2017","reviewTitle":"Lovely lunch","postReview":"Lunch at the American Bounty is quite a contrast to the stuffiness of the Bocuse (though you'll see some overlap in key ingredients). But once again there were some really good flavors. Portions are larger, prices are lower. Good value. Students are chatty if you...More","starRating":"40","averageRating":0},{"fullName":"Cookierow","postDate":"May 1, 2017","reviewTitle":"Surprisingly bad","postReview":"The service was charming but the food was way below average. The appetizer ravioli was cold, the shrimp cocktail was tiny and both the steelhead trout and sea bass were oversalted.","starRating":"20","averageRating":0},{"fullName":"Lynne C","postDate":"April 27, 2017","reviewTitle":"Great experience","postReview":"When planning a stop in Hyde Park,we decided to include dinner at the CIA's American Bounty restaurant. It was a great experience. We were seated near the bakery bubble so we could observe the students at work. The meal was very good - interesting combinations...More","starRating":"50","averageRating":0},{"fullName":"colekat","postDate":"April 26, 2017","reviewTitle":"It's very good for a training school","postReview":"If you average all the results it was above my expectations. The service was excellent, the menu outstanding, the facilities are beautiful. The execution of the dishes was the shortfall. Lamb was over cooked, the ravioli were dry but the duck was well prepared and...More","starRating":"40","averageRating":0},{"fullName":"MawaNewYork","postDate":"April 11, 2017","reviewTitle":"Oh, so good!","postReview":"If possible, try out all of the Culinary Institute of America's restaurants! Each one is different in style, food and atmosphere, but all are exceptional in each area. The standout memory of our visit to American Bounty was a dessert that was out of this...More","starRating":"50","averageRating":0},{"fullName":"risi59","postDate":"April 10, 2017","reviewTitle":"Maybe It Was a Bad Night to Go?","postReview":"Maybe I had raised my expectations to high, but I was unimpressed. I get the fact that you go for taste vs. portion size, but I was disappointed in the items ordered. The best items were the chef offered tastings and desert. The service was...More","starRating":"20","averageRating":0},{"fullName":"DGustibus","postDate":"March 7, 2017","reviewTitle":"Quite good, and surprisingly cheap","postReview":"The important thing at CIA is the food, not the service — which (I understand) is just a three-week apostrophe at the end of each student’s training. After all, this isn’t the Footman Institute of America; it’s *all* about the cooking, and the cooking is...More","starRating":"40","averageRating":0},{"fullName":"JudyTroy_NY","postDate":"February 20, 2017","reviewTitle":"Satisfying!","postReview":"Have been here several times and always enjoy interacting with the students from the culinary arts program. We drove down from upstate NY to meet up with our son and daughter in law from NYC who took the train up to Poughkeepsie. Lovely setting with...More","starRating":"50","averageRating":0},{"fullName":"Steven S","postDate":"February 20, 2017","reviewTitle":"Birthday Lunch","postReview":"We had such a great time chatting with our terrific student server from Beijing. Great to share his experience. Lunch was great deal at three courses for 26$. I had rack of lamb and my wife pan roast chicken. Lamb was super tasty and tender....More","starRating":"50","averageRating":0},{"fullName":"chestnuthouse","postDate":"December 22, 2016","reviewTitle":"Exorbitant Prices, Miniscule Portions","postReview":"I've dined at American Bounty many times over the past 30 years and always been delighted, but things have changed - except for the beautiful ambiance. The appetizers can't be shared, the portion is barely enough for one. The entrees are likewise very small. For...More","starRating":"20","averageRating":0},{"fullName":"Nan F","postDate":"December 21, 2016","reviewTitle":"Something missing in the training?","postReview":"My husband and I arrived for a late lunch on a very busy day---100 students were graduating, and lots of family and friends were dining in the 4 restaurants in the main hall at the Culinary Institute of America. The tavern was almost empty when...More","starRating":"30","averageRating":0},{"fullName":"Nathaniel M","postDate":"November 28, 2016","reviewTitle":"Wild game dinner","postReview":"Been here twice and will go again. Food at the CIA is always great. This dinner featured wild game and rare beers. As always the CIA service and cuisine is incomparable for the price.","starRating":"50","averageRating":0},{"fullName":"DeborahL428","postDate":"November 19, 2016","reviewTitle":"The Tavern at American Bounty Excellent Food","postReview":"This tavern portion of the Bounty is cozy and inviting. On the Saturday before Thanksgiving and a beautiful, sunny, warm November day, the place was crowded but not a long wait at all. A few minutes browsing in the gift shop down the hall and...More","starRating":"50","averageRating":0},{"fullName":"Lee L","postDate":"November 16, 2016","reviewTitle":"Amazing 5 star cuisine","postReview":"We have eaten here many times and it has been amazing every time. The student chefs do everything - front and back of the house. We just love visiting the Culinary Institute of America!","starRating":"50","averageRating":0},{"fullName":"PCGal","postDate":"November 9, 2016","reviewTitle":"Good food in a fun atmosphere","postReview":"We ate in the Tavern area of the American Bounty restaurant and the food was delicious. All of the restaurants inside the main building at the Culinary Institute had good menus but we were in the mood for more American type food.","starRating":"50","averageRating":0},{"fullName":"LollysLook","postDate":"October 20, 2016","reviewTitle":"Great meal","postReview":"We had a nice lunch here after doing some leaf peeping and walking over the Hudson bridge. The waitstaff and the chefs did a wonderful job. The food was excellent and service was perfect.","starRating":"40","averageRating":0},{"fullName":"Beeper99_12","postDate":"October 20, 2016","reviewTitle":"Great dining experience","postReview":"The culinary planets were in alignment a couple of nights ago when seven of us got together for dinner at the American Bounty. When we arrived we were promptly escorted to our table (that doesn't always happen) and were served throughout the night by a...More","starRating":"50","averageRating":0},{"fullName":"ellentravels","postDate":"October 17, 2016","reviewTitle":"Very fine dinner","postReview":"Part of the Culinary Institute of America, this restaurant is staffed by student chefs, waitstaff, etc. Excellent 4 course dinner with good wines: soup, salad, entree of grilled salmon and dessert. Definitely worthwhile","starRating":"50","averageRating":0},{"fullName":"pamh86","postDate":"October 16, 2016","reviewTitle":"Uneven","postReview":"Our niece is a successful CIA graduate so we always make a point to dine here when we are in the area. Meal was uneven for the four of us. Salads were skimpy for the $11 price tag and half of my husband's lamb was...More","starRating":"30","averageRating":0},{"fullName":"nanar226","postDate":"October 13, 2016","reviewTitle":"The Tavern at American Bounty","postReview":"We went to the Culinary Institute of America for lunch-and we went without a reservation. We originally intended to go to the Apple Pie Bakery, based on the recommendation of a local. The line was quite long to get in, so I wandered down the...More","starRating":"50","averageRating":0},{"fullName":"camtcb","postDate":"October 6, 2016","reviewTitle":"Very nice dinner","postReview":"My family and I had a very nice dinner here during our son's family weekend at college. We all enjoyed our food and the service was good too. I would definitely go back.","starRating":"50","averageRating":0},{"fullName":"patc909","postDate":"October 4, 2016","reviewTitle":"A treat for the taste buds!","postReview":"After a very informative tour of the Culinary Institute of America, we ended our day with a wonderful meal at this restaurant. I had pork tenderloin, and my husband had swordfish. We also each had a different soup and dessert. All of it was wonderfully...More","starRating":"40","averageRating":0},{"fullName":"Cathy R","postDate":"September 24, 2016","reviewTitle":"Such a great experience","postReview":"There are six restaurants at the Culinary Institute of America, and the students must work at each one before graduation, as chefs as well as managers and servers. They are carefully supervised by professionals. What I didn't know is that there is a set progression....More","starRating":"50","averageRating":0},{"fullName":"Connie-7","postDate":"September 21, 2016","reviewTitle":"overpriced pretentious rip-off","postReview":"If you enjoy having a steak the size of a tootsie roll, a teaspoon of creamed spinach for a side and one (I am not kidding) French fry, then this is the place for you. $215 for 4 people, all of whom were hungry afterwards.","starRating":"10","averageRating":0},{"fullName":"ChrisandCindy08","postDate":"September 16, 2016","reviewTitle":"Highly would go here","postReview":"Enjoy a special treat at the CIA. Has 3 course meal. gourmet style meal, beautiful plated. All done by students at the CIA. Would go again, don't miss this.","starRating":"50","averageRating":0},{"fullName":"HellsKitchen_M","postDate":"September 12, 2016","reviewTitle":"American Bounty Tavern","postReview":"This is a new addition to the CIA. As with the main American Bounty restaurant, this one has excellent farm-to-table cooking with seasonal ingredients, but without needing the long-in-advance reservations and without the white tablecloth feeling. The students here will soon be starting restaurants of...More","starRating":"40","averageRating":0},{"fullName":"IrmaG497","postDate":"September 8, 2016","reviewTitle":"Day with the Gourmets","postReview":"After taking a tour of the Culinary Institute, we appreciated the amazing dedication and skill that the students have. They are creative artists who have been trained in every aspect of the culinary arts. After our tour, we went to the American Bounty restaurant. The...More","starRating":"50","averageRating":0},{"fullName":"muszekfan","postDate":"August 31, 2016","reviewTitle":"Amazing meal!","postReview":"I'd say I had the best restaurant meal of my life at this place! The service was impeccable and the food was incredible. I feasted on strip steak that I asked for well-done and it was still tender as butter. Everything was beautifully presented and...More","starRating":"50","averageRating":0},{"fullName":"Go539176","postDate":"August 31, 2016","reviewTitle":"Phenomenal","postReview":"The food the service was nothing short of amazing. If we lived closer i would be there every week My son was attending a program so it was a set menu with four courses, every course did not disapoint","starRating":"50","averageRating":0},{"fullName":"MrSpiceMan","postDate":"August 3, 2016","reviewTitle":"Great dinner experience","postReview":"Took the 4 PM tour of the Culinary Institute, then reservation at 6. Only issue: they should offer 1st seating at 5 - we had to kill an hour until they would seat us. Everything else was awesome - food, service, and ambiance were all...More","starRating":"50","averageRating":0},{"fullName":"Xicorea","postDate":"August 2, 2016","reviewTitle":"Not your average student restaurant","postReview":"We recently had dinner at American Bounty and had a very enjoyable experience. We made the reservations online, several weeks in advance, so we had no trouble getting our preferred date and time. CIA also has French and Italian restaurants, but we preferred this one...More","starRating":"50","averageRating":0},{"fullName":"Steve D","postDate":"July 31, 2016","reviewTitle":"Nice experience and great food","postReview":"Located on the beautiful campus of the Culinary Arts Institute. Very good service and food to die for. We sat in area that has glass wall which you can view and kitchen staff through. Our server was a nice young man who is about to...More","starRating":"50","averageRating":0},{"fullName":"636debrap","postDate":"July 29, 2016","reviewTitle":"Food beyond expectations","postReview":"We were lucky to land reservations on evening before graduation. All serving in the restaurant were graduating the next day. When most would be celebrating, these students were still \"in school\" and our waiter took his job very seriously. This is a teaching environment and...More","starRating":"50","averageRating":0},{"fullName":"B8022OZmichaelm","postDate":"July 26, 2016","reviewTitle":"Beautiful setting, but food doesn't stack up","postReview":"We had dinner there recently. On the plus side, the setting is beautiful. The campus is large and pretty as is the architecture, and the view is nice. On the negative side: The service was extremely rushed: No sooner had the waiter poured some wine...More","starRating":"30","averageRating":0},{"fullName":"hoagieny","postDate":"July 26, 2016","reviewTitle":"Lunch at American Bounty","postReview":"Our annual high school get-to-gether this year; three of my friends traveled to Hyde Park to join me for lunch. Food was wonderful; a favorite amongst three of us was the New Zealand mussel appitizer portion was huge; entrees of salmon and chicken were delicious...More","starRating":"50","averageRating":0},{"fullName":"Cyrnanc","postDate":"July 25, 2016","reviewTitle":"Nice lunch! Excellent presentation","postReview":"We finally were able to coordinate a date for our family of nine to go to American Bounty. Since we were traveling an hour and a half we decided to go for lunch. They sat us at a lovely round table and were able to...More","starRating":"40","averageRating":0},{"fullName":"216LNS","postDate":"July 25, 2016","reviewTitle":"Best part was chatting with the servers","postReview":"Our meal was interesting and some of it was truly delicious, especially the salmon with a melange of woodsy vegetables. The salads were way too small, especially for the price. We loved chatting with the sommelier and our server who told us all about their...More","starRating":"40","averageRating":0},{"fullName":"SteveandMolly","postDate":"July 25, 2016","reviewTitle":"Great fun, good food, and wonderful wait staff","postReview":"The CIA has several restaurants on its campus in Hyde Park. We only had time for this one on our recent visit, but we loved our experience. The atmosphere is comfortable and a bit eclectic, and the food is creatively prepared and presented. It is...More","starRating":"40","averageRating":0},{"fullName":"NJ_Traveler2008","postDate":"July 24, 2016","reviewTitle":"Pleasant lunch","postReview":"We stopped in at the CIA (Culinary Institute of America), to see if we could have lunch, as we were traveling north. We didn't really expect to be able to eat there, but were surprised that they accepted walk ins and that the Tavern was...More","starRating":"40","averageRating":0},{"fullName":"risserapp","postDate":"July 21, 2016","reviewTitle":"Suprisingly Awesome!","postReview":"Went with a tour group and was skeptical how good a prefixed meal would be? The 3 course chicken entree was outstanding from the homemade rolls to the dessert! Excellent service also! I wish I lived nearby.Highly recommended!","starRating":"50","averageRating":0},{"fullName":"WFleet","postDate":"July 10, 2016","reviewTitle":"A Botched Experience","postReview":"We visited with fairly middle of the road expectations, given this is a cooking school and the chefs and servers are all learning the craft. We were surprised at how clunky the service was and that the food, overall, was not good. Our server was...More","starRating":"20","averageRating":0},{"fullName":"Marge C","postDate":"July 6, 2016","reviewTitle":"Super lunch experience","postReview":"We were happy to see a slightly different menu for lunch here than what's on the internet for this restaurant. And the prices were a little lower which helped us have all 3 courses which we enjoyed immensely. Yes, the portions aren't huge but quite...More","starRating":"50","averageRating":0},{"fullName":"Slukaske","postDate":"June 28, 2016","reviewTitle":"Overpriced and only adequate","postReview":"We went to the American Bounty restaurant at the Culinary Institute with very high expectations and were very disappointed. The service was mediocre - they took away our silverware after each course, then served the next course and then had wait for the appropriate silverware...More","starRating":"20","averageRating":0},{"fullName":"Rebecca W","postDate":"June 24, 2016","reviewTitle":"Great lunch","postReview":"This was a great place for lunch. It is like a '50's diner. Great cheeseburgers and milk shakes. Also great salads and other entrées. Good attentive and prompt service.","starRating":"50","averageRating":0},{"fullName":"Pamela S","postDate":"June 23, 2016","reviewTitle":"More vegetarian options please","postReview":"More than one vegetarian entree choice would have been nice, the 2 sides I ordered for my entree were good but not special. Was unable to eat the amuse (duck) the little rolls were great. Service was excellent","starRating":"50","averageRating":0},{"fullName":"Anne C","postDate":"June 22, 2016","reviewTitle":"Culinary Institute of America Restaurant","postReview":"When in Hyde Park, you must try the American Bounty restaurant. The students at the CIA are really trying to learn a skill and I think when you try their cooking you will see that they are definitely super chefs! My daughter was a Pastry...More","starRating":"40","averageRating":0},{"fullName":"cmg3","postDate":"June 3, 2016","reviewTitle":"Where great chefs are trained","postReview":"We had an outstanding dinner experience there. The food is fresh, the preparation is meticulous, the presentation is memorable, and the service is outstanding. We were there 45 years ago (at the Escoffier) when it was prix fixe, this time it was American Bounty and...More","starRating":"50","averageRating":0},{"fullName":"6830self","postDate":"June 3, 2016","reviewTitle":"Fantastic food and service","postReview":"Excellent place to celebrate a very special occasion. The service is exceptional and so is the food. Suggest you check the menu on line and make the required reservation.","starRating":"50","averageRating":0},{"fullName":"Afoodie65","postDate":"May 31, 2016","reviewTitle":"Another visit-not as great","postReview":"My wife and I visited with another couple recently. One complaint: the waitstaff was not as professional as we have had in past visits; one of the servers even addressed us as \"you guys\", a greeting rarely heard at CIA. The meals with an exception...More","starRating":"40","averageRating":0},{"fullName":"Justine B","postDate":"May 23, 2016","reviewTitle":"Delicious duck!","postReview":"We came here for dinner on a Friday night. Spring pea soup was delicious, but the added items (purple potatoes, fiddleheads, and morel mushrooms) left something to be desired as far as taste and texture. The bison and the duck were perfectly cooked and fantastic....More","starRating":"40","averageRating":0},{"fullName":"goinggreenmom","postDate":"May 19, 2016","reviewTitle":"Never more disappointed!","postReview":"I looked forward to dining here for a number of years and either my schedule prohibited me from fulfilling that or I could not get a reservation. After tonight I have no idea why this restaurant has received such high ratings. From the time we...More","starRating":"10","averageRating":0},{"fullName":"cassiez1016","postDate":"May 18, 2016","reviewTitle":"Tavern at American Bounty","postReview":"I met my mom in Hyde Park for Mother's day, and I tried to get a reservation for Saturday night, but could not! Luckily, Saturday at lunch time (and all day I'm pretty sure), they open a portion of the restaurant called The Tavern for...More","starRating":"50","averageRating":0},{"fullName":"moon-mouse","postDate":"May 9, 2016","reviewTitle":"Best Duck EVER","postReview":"LOVE eating and visiting the CIA! It's a must when in Hyde Park. Plan ahead all CIA restaurants book a week or more ahead. We were able to get in a last minute lunch at the American Bounty and it was lovely. We weren't crowded...More","starRating":"50","averageRating":0},{"fullName":"biztraveler30","postDate":"May 3, 2016","reviewTitle":"Inventive food, great service, worth the visit!","postReview":"I ate here during a work trip and was completely impressed. I had just done a tour of the CIA and it was clear that the students that served us were well trained. We had a fixed four course meal that included a salad, ravioli,...More","starRating":"50","averageRating":0},{"fullName":"Larry M","postDate":"May 1, 2016","reviewTitle":"Excellent food, service and decor","postReview":"What a great dining experience and not as expensive as some other restaurants we've visited. Service was extraordinary like we've enjoyed in the past in such places as Emeril's in New Orleans and during a private dining experience in a restaurant local to us. Food...More","starRating":"50","averageRating":0},{"fullName":"Katie C","postDate":"April 29, 2016","reviewTitle":"Holy yum!","postReview":"Simply the best. I loved the menu. The staff was excellant. AND THE FOOD... I am still having dreams and day dreams about the food I have eaten there. These chefs are truly talented individuals. Their passion for creating edible masterpieces is so evident in...More","starRating":"50","averageRating":0},{"fullName":"Cruising2by2","postDate":"April 20, 2016","reviewTitle":"Must stop and experience if you are in Hyde Park NY","postReview":"We had dinner 2 nights in a row here at American Bounty and Bocuse, both on the CIA campus. Each has their own \"feel and style\". American is a farm to table using locally sourced product including the wines which were from NY state. Servers...More","starRating":"50","averageRating":0},{"fullName":"Ajani G","postDate":"April 4, 2016","reviewTitle":"Overall lovely experience","postReview":"Came here to celebrate my husbands birthday. The restaurant was accommodating in our tardy arrival and the service was excellent. They remembered that it was his birthday and they were sure to treat him extra special. The food was great and everyone was knowledgeable. At...More","starRating":"40","averageRating":0},{"fullName":"Afoodie65","postDate":"March 24, 2016","reviewTitle":"One of our best meals, ever!!","postReview":"Because the NY CIA has 2 outstanding restaurants, Bocuse & di Medici, we have not been visiting the American Bounty until last month. At lunch we went with the prix fixe ($29) and came away totally satisfied. The meal began with warm gluten free rolls...More","starRating":"50","averageRating":0},{"fullName":"Jack S","postDate":"March 23, 2016","reviewTitle":"Worth the 2.5 Hour Drive!","postReview":"Decided to knock off a bucket list item by having lunch at American Bounty. Service was excellent (better than most \"real\" restaurants) and if you ask, the students will share a lot of interesting tidbits about CIA with you. Wine list was simple but ample....More","starRating":"40","averageRating":0},{"fullName":"linda s","postDate":"March 17, 2016","reviewTitle":"Delicious but still room for improvement","postReview":"This was our second visit to this restaurant. Both visits were during restaurant week and this time we brought other family members. OK, I'll admit it, we are all \"foodies\" and big eaters. The food was delicious but the portion sizes are pitiful. In addition,...More","starRating":"50","averageRating":0},{"fullName":"Linda S","postDate":"March 15, 2016","reviewTitle":"Not consistent dining....not worth the price!","postReview":"While this is one of the restaurants of the Culinary Institute of America it is hardly the best dining experience. The quality of the meals is not consistent nor is the service. Imagine a \"next day graduate\" who does not know how to properly pour...More","starRating":"30","averageRating":0},{"fullName":"drlindak59","postDate":"March 15, 2016","reviewTitle":"Delightful Lunch Today","postReview":"We had a marvelous lunch, start to finish, at the American Bounty Restaurant today. It was an incredible value for Restaurant Week, with the entire menu to choose from. Very friendly, attentive and well-informed service staff, novel appetizers, delicious and varied entrees, and excellent pressed...More","starRating":"50","averageRating":0},{"fullName":"Liz F","postDate":"March 15, 2016","reviewTitle":"Outstanding and Delicious","postReview":"American Bounty exceeded my expectations in that the cuisine, service and atmosphere were all top drawer. Not in-training-to-be-top-drawer, but already world class. I had the citrus salmon salad, chicken on farro and brussels sprouts...and the chicken waffle (I'll leave it to your waiter to clue...More","starRating":"50","averageRating":0},{"fullName":"Traveller_savvy","postDate":"March 13, 2016","reviewTitle":"Superb ambience- excellent food - Restaurant week.","postReview":"We family of 3 celebrating our 15th anniversary. It happened to be restaurant week so turned out to be super cheap. It was absolutely amazing. The food was superb, ambiance was cozy, and impressed by the professionalism and presentation. The server was sweet and attentive....More","starRating":"50","averageRating":0},{"fullName":"Woolite-13","postDate":"March 13, 2016","reviewTitle":"Wonderful place for lunch!","postReview":"We were lucky enough to get a restaurant week reservation, Hard to believe that you are eating in a classroom! the cooks, waiters, and all of the staff are students. The food is amazing. right at first the cutest little baking pan of rolls arrived,...More","starRating":"40","averageRating":0},{"fullName":"jaclynd2016","postDate":"March 5, 2016","reviewTitle":"Great bar service","postReview":"Just went to American Bounty for a drink before dinner at Bocuse. Had a wonderful bartender and enjoyed trying the beers brewed locally on the CIA campus. Enjoyed the atmosphere and the drinks!","starRating":"50","averageRating":0},{"fullName":"Melonie S","postDate":"February 19, 2016","reviewTitle":"If it was my first time ever, I would never go back!","postReview":"My family and I have dined here several times over the years at the CIA but this had to be our most disappointing visit yet. Our last trip to the CIA in March of 2015 was phenomenal. We made reservations for Saturday, February 13, 2016,...More","starRating":"20","averageRating":0},{"fullName":"MrsReign","postDate":"February 14, 2016","reviewTitle":"An OK Valentines dinner, but nothing spectacular .","postReview":"my husband & I have eaten here before, and he was able to get us a 7:45 reservation for the night before V-Day earlier that week. We had called on Saturday to see if we could get an earlier seating and were told the restaurant...More","starRating":"30","averageRating":0},{"fullName":"kevinSL","postDate":"February 9, 2016","reviewTitle":"Wow wow wow","postReview":"Ok we all know these are the future to chefs and ever bite me and my wife took was something you want to remember later. Service was ok no better or worse then any other restruant. What u might not know is they have a...More","starRating":"50","averageRating":0},{"fullName":"309allan","postDate":"February 8, 2016","reviewTitle":"American cuisine","postReview":"Eat here several times per year. Almost always quite good. Need to be patient with student servers. This is part of their curriculum. What they may lack in polish, experience they make up for in enthusiasm. Some meals/combos work better than others.","starRating":"40","averageRating":0},{"fullName":"babyoscar530","postDate":"February 6, 2016","reviewTitle":"Great Lunch with Excellent Service","postReview":"We had been planning a trip here for 4 years and cancelled twice due to snow conditions. Be aware you will have to book few months in advance, we booked 3 months in advance for February 2016. Few years back we were warned to book...More","starRating":"50","averageRating":0},{"fullName":"Morgan2010","postDate":"January 18, 2016","reviewTitle":"Great flavors and presentation. Excellent culinary experience","postReview":"No other way to say it - a great evening. As we had already had happy hour elsewhere, we avoided the bottle of wine and instead ordered a glass of a nice North Fork Merlot and I had the CIA-produced stout - very good. Our...More","starRating":"50","averageRating":0},{"fullName":"ChinadollRVC","postDate":"January 9, 2016","reviewTitle":"Good Overall, if a Bit Uneven","postReview":"I planned a whole day in and around Hyde Park for my husband's recent birthday. Decided to include a stop for lunch at American Bounty, one of the restaurants run and staffed by the CIA, Culinary Institute of America, located right on their impressive campus....More","starRating":"40","averageRating":0},{"fullName":"Joel W","postDate":"December 14, 2015","reviewTitle":"One of the Best Places in Town","postReview":"Along with the other restaurants at the CIA, American Bounty is one of the best restaurants in town. Excellently prepared food along with perfect service make this a dining pleasure. Don't miss the creative presentations of every dish as this is part if the fun....More","starRating":"50","averageRating":0},{"fullName":"C390TFdavidn","postDate":"November 23, 2015","reviewTitle":"Excellent use of regional and seasonal ingredients","postReview":"This restaurant is a working classroom for students at the CIA, and they work all aspects of both the front and back of the house. The food was exquisite and the service was earnest, even if not perfect. It was fun talking with the student...More","starRating":"50","averageRating":0},{"fullName":"Sue P","postDate":"November 18, 2015","reviewTitle":"Your tastebuds will thank you!","postReview":"This was the second restaurant at CIA we visited and we were so glad we did. The food is so good you want more! This is what good food is. Everything we had we enjoyed, and the desserts were incredible. The students in this school...More","starRating":"50","averageRating":0},{"fullName":"bigguy2344","postDate":"November 11, 2015","reviewTitle":"Restaurant week!","postReview":"My wife and I enjoyed lunch at AB yesterday 11/11/15. The restaurant week special is $20.95 for a price fix menu that includes either soup, salad, or appetizer...an entree and a desert. The food is fabulous. I had a salmon appetizer an could have stopped...More","starRating":"50","averageRating":0},{"fullName":"tm s","postDate":"November 6, 2015","reviewTitle":"A treat for your tastebuds!","postReview":"We celebrated our 21st wedding anniversary with dinner at American Bounty. I had been there before with girlfriends, but wanted to take my husband. Each course was enchanting - flavors combined in ways we have never experienced before. The wait staff was attentive and precise....More","starRating":"50","averageRating":0},{"fullName":"Gershwin12","postDate":"November 6, 2015","reviewTitle":"The Way Food is Supposed to Taste","postReview":"My husband and I dine at The Culinary Institute, one to two times a year. It reminds us what great food is supposed to taste lake and what restaurant hospitality should be. Our recent visit did not disappoint. The service was attentive, friendly and professional...More","starRating":"40","averageRating":0},{"fullName":"gram1998","postDate":"October 16, 2015","reviewTitle":"Spectacular Lunch","postReview":"We were told by many friends when we make plans to visit the Hudson Valley that we had to include a visit to the Culinary Institute of America. I totally concur now that we have experienced a meal there. The food was incredible, the service...More","starRating":"50","averageRating":0},{"fullName":"Peacock32","postDate":"October 6, 2015","reviewTitle":"A Genuine Dining Experience not to be missed.","postReview":"When I pre-booked our table, it was rather pot-luck which of the CIA restaurants I booked in, but boy! did we hit the jackpot. I cannot speak highly enough of the quality of our meal, and the service was just right. Our friend who ate...More","starRating":"50","averageRating":0},{"fullName":"Bill13669","postDate":"September 26, 2015","reviewTitle":"Exquisite, five star dining experience","postReview":"We attended with a group of 35 who attended a pre dinner experience with a Physiology of Taste seminar conducted by one of the Professors at The CIA (Culinary Institute of America) and had dinner at the American Bounty. The service was perfect, while the...More","starRating":"50","averageRating":0},{"fullName":"Bowlby324","postDate":"September 25, 2015","reviewTitle":"Worth the Trip","postReview":"The American Bounty restaurant, part of the Culinary Inst. of America(CIA), is worth visiting. Yes, you are served by students but they have been well-trained Yes, some of the dishes are on the small side, and yes, the prices are higher than expected. You need...More","starRating":"50","averageRating":0},{"fullName":"ilovetotravelfar","postDate":"September 24, 2015","reviewTitle":"Great food, loud and tiny appetizers","postReview":"The appetizers were delightful but unexpectedly tiny portions. The main dishes were extremely tasty. The price tag was a bit steeper than expected.","starRating":"40","averageRating":0},{"fullName":"John L","postDate":"September 23, 2015","reviewTitle":"Wow!","postReview":"Great American flavor. Salmon dish and chicken dish were excellent. Service was superior to any other I've experienced.","starRating":"50","averageRating":0},{"fullName":"NozyRev","postDate":"September 21, 2015","reviewTitle":"Even loved the bartender!","postReview":"We did not have reservations on a Friday night and ended sitting at the bar. He helped to make the dinner even more delicious. Both of us do not drink alcoholic beverages which made watching the bartender mix the amazing drinks delightful. I had the...More","starRating":"50","averageRating":0},{"fullName":"d k","postDate":"September 20, 2015","reviewTitle":"underwhelmed","postReview":"service ruined the experience, would not go back, and we are big fans of the other CIA restaurants -- the person who \"checked\" us in was wonderful though","starRating":"30","averageRating":0},{"fullName":"NJtraveller95","postDate":"September 1, 2015","reviewTitle":"Great experience","postReview":"By an amazing miracle, there was a cancellation for dinner when we were in the Hyde Park area. We had really nice dinner at the American Bounty. Considering the personnel were folks in training supervised by their teachers, the dinner and the service we received...More","starRating":"50","averageRating":0},{"fullName":"happytraveller914","postDate":"August 26, 2015","reviewTitle":"Beautiful spot and hard-working aspiring chefs, but has some problems","postReview":"My husband and I had lunch today at American Bounty, which was our third visit to the Culinary Institute of America in Hyde Park. The campus is breathtaking in its beauty and it is always a joy to visit this spot. While overall our meal...More","starRating":"40","averageRating":0},{"fullName":"KarenGTK","postDate":"August 21, 2015","reviewTitle":"Disappointed","postReview":"So excited but disappointed. We had to wait too long for water or for the waiter to acknowledge us. The entrees of duck breast and chicken breast were lacking in flavor. But the foie gras was exceptional - so tender and rich with a variety...More","starRating":"30","averageRating":0},{"fullName":"Rita2rock","postDate":"August 20, 2015","reviewTitle":"Excellent food","postReview":"Try to sit close to the big kitchen window as you can watch the chefs at work. It's an amazing experience and the food is out if this world. The servers are very happy to answer any question you have about the food and about...More","starRating":"40","averageRating":0},{"fullName":"robcurtross","postDate":"August 17, 2015","reviewTitle":"Students really trying hard -- and often succeeding","postReview":"This is one of the several restaurants at the Culinary Institute of America. Jonathan Zearfoss is the current head chef, assisted by students at the Institute. \"Almost every profession has an outstanding training ground. The military has West Point, music has Juilliard, and the culinary...More","starRating":"40","averageRating":0},{"fullName":"Andrea P","postDate":"August 12, 2015","reviewTitle":"Always Amazing","postReview":"My son graduated from the Bachelors program at Culinary Institute so we have had many meals at the Bounty. It is always delicious and beautifully plated. I understand the restaurant will be undergoing renovations this year, 2015 and will be moved to another location..not sure...More","starRating":"50","averageRating":0},{"fullName":"JKBD","postDate":"July 25, 2015","reviewTitle":"Consistently fabulous meal from students taking a class","postReview":"First it is important to note that all servers and kitchen crew are students and that this is a class where they are learning and receiving a grade. Students spend three weeks in the front or back of the house and then switch. Depending on...More","starRating":"50","averageRating":0},{"fullName":"2Montvale","postDate":"July 24, 2015","reviewTitle":"Everything was perfect!","postReview":"I have wanted to eat at the Culinary Institute for years and finally had my chance this past Wednesday night. I can't say enough good things about the service and the food but basically everything was top notch. Fresh, hot baked bread was delivered to...More","starRating":"50","averageRating":0},{"fullName":"Rosemary A","postDate":"July 21, 2015","reviewTitle":"An adventure in taste","postReview":"We were seated promptly and shown a very extensive menu. The food pairings were intriguing but I decided on the Beet and honey salad followed by pork tenderloin. There were four of us and all the dihes were innovative and brilliantly presented.","starRating":"50","averageRating":0},{"fullName":"famvacations","postDate":"July 11, 2015","reviewTitle":"Not great","postReview":"We made online reservations for a Thursday night in May while attending college orientation for our son in the area. We had high expectations based on the reputation of the CIA but it was not great. The student server brought us drinks, then it was...More","starRating":"20","averageRating":0},{"fullName":"JCheng","postDate":"July 9, 2015","reviewTitle":"The best ingredients!","postReview":"We had the oysters, stinging nettle soup, market fish (sea bass), long island duck breast, and the Rhubarb and Green Tea cake. All well prepared and beautifully presented. We will be back.","starRating":"50","averageRating":0},{"fullName":"Rosalie C","postDate":"July 2, 2015","reviewTitle":"Fresh and flavorful to the utmost","postReview":"Food used the freshest ingredients with amazing flavors. Presentation was perfect. You would never know your servers and those preparing your meals under the guidance of master chef instructors are students. Total professionalism. And their friendly demeanor makes for a totally enjoyable and relaxing dining...More","starRating":"50","averageRating":0},{"fullName":"douellet","postDate":"June 27, 2015","reviewTitle":"Fine dining at a great price","postReview":"We had a wonderful meal. The service was very good also. Our server spent some time talking about his experiences at CIA which I found very interesting.","starRating":"50","averageRating":0},{"fullName":"SNumerator","postDate":"June 20, 2015","reviewTitle":"A Cum Laude Experience","postReview":"We booked this CIA restaurant for a weekend night at an early date because a number of trip advisor visitors and others had so suggested. The restaurant called twice to confirm suggesting that demand is strong. It was near graduation and many of our servers...More","starRating":"40","averageRating":0},{"fullName":"Roseann S","postDate":"June 18, 2015","reviewTitle":"quite a treat","postReview":"Knowing we were going to be up in Hyde Park, we made reservations prior to our stay. The atmosphere was very nice. The food was different than what we would normally eat, but it was a nice change-up. the portions are adequate especially if you...More","starRating":"40","averageRating":0},{"fullName":"Phyllis B","postDate":"June 10, 2015","reviewTitle":"Disappointed","postReview":"Not up to CIA standards. Very disappointed. Wanted to be doted on, but not at all the case. Waiter was more interested in himself rather than the 12 of us there.","starRating":"30","averageRating":0},{"fullName":"drivinexplorer","postDate":"June 9, 2015","reviewTitle":"Excellent prix fixe meal","postReview":"The price fixe meal my sister and I had was in honor of Mad Men's last episode and had a 1960s theme. I had a caesar salad, the New York strip main course, and pineapple upside down cake. It was all excellent! I enjoyed this...More","starRating":"50","averageRating":0},{"fullName":"Wolfgangamadeusmarco","postDate":"May 30, 2015","reviewTitle":"Supperb dinning cooked by future chefs","postReview":"From the school that gave us Anthony Bourdain, Richard Blais, and Mr. Bizarre foods Andrew Zimmernm we enjoyed an divine meal while visiting the Roosevelt's Hyde Park making it the perfect complement of our trip.","starRating":"40","averageRating":0},{"fullName":"srhahm","postDate":"May 29, 2015","reviewTitle":"Scrumptious chicken","postReview":"On bus tour of area & had group meal. Everyone oohed & aahed over meal. Sauteed chicken breast with roasted garlic potato gratin & spinach.","starRating":"50","averageRating":0},{"fullName":"genav811","postDate":"May 27, 2015","reviewTitle":"Awesome food from the chefs-in-training","postReview":"Ate here for a price-fixed dinner, The food was great, nice presentation, ambiance nice. The portions were very good. The students were friendly albeit seemed nervous. I guess the instructors are over seeing them and can get into trouble if we were not happy. We...More","starRating":"40","averageRating":0},{"fullName":"Tom X","postDate":"May 24, 2015","reviewTitle":"Great food and service, but could we please have some decent wine?","postReview":"My wife and I had lunch here recently. Food was quite good and we enjoyed the service from the enthusiastic but inexperienced students. My only objection is that the wine list is almost 100% NY State and (speaking as someone born and raised in NY),...More","starRating":"30","averageRating":0},{"fullName":"marvin b","postDate":"May 19, 2015","reviewTitle":"price fixe","postReview":"The chefs in training offer a knock out deal during the weekdays. The food is always interesting and delicious. The service is good but these are students so often it is more fun to engage them and find out why they are at the chef...More","starRating":"50","averageRating":0},{"fullName":"giftedelaine","postDate":"May 16, 2015","reviewTitle":"Greata food, great service, great view!","postReview":"What a wonderful lunch we had! The restaurant is located in the main CIA building and there is ample visitor parking relatively close by. The restaurant is \"run\" by students under the supervision of their teachers and professors. The restaurant is lovely inside with a...More","starRating":"40","averageRating":0},{"fullName":"Cathy B","postDate":"May 3, 2015","reviewTitle":"Great food and wonderful service","postReview":"What's not to love about this place. The location is lovely - right on the Hudson - the service wonderful and the food out-of-this-world. My husband and I came here for dinner and were seated by a charming young student in a white tux (didn't...More","starRating":"50","averageRating":0},{"fullName":"PAL52772","postDate":"April 30, 2015","reviewTitle":"Very Enjoyable","postReview":"We attended the \"Street Food\" event at American Bounty. Some good traditional food choices... The company at the table made it extra special. Some choices better than others... A bit over priced for what was offered but will always love the atmosphere at the CIA","starRating":"40","averageRating":0},{"fullName":"jazanana","postDate":"April 23, 2015","reviewTitle":"Amazing Food & Service","postReview":"It is not fair to indicate if this is a restaurant for friends, family, business or couples, because it is an excellent experience for all! We all opted for the \"prefix\" dinner with choice of one either salad, soup, or appetizer, a dinner plus dessert....More","starRating":"50","averageRating":0},{"fullName":"FLBfive","postDate":"April 19, 2015","reviewTitle":"One of my bucket list restaurants","postReview":"Have been wanting to go here for awhile. Made a reservation through Open Table. The place is warm and inviting. Reminded me of a fancy steak house. LOVED the butternut squash soup. Had braised duck gnocchi which was good. Enjoyed the ricotta meatballs and the...More","starRating":"40","averageRating":0},{"fullName":"JerzeeeyGirl","postDate":"April 18, 2015","reviewTitle":"Fantastic experience","postReview":"First, I'm trying to understand how one of my better restaurant meals was prepared by students who have like, two minutes of culinary experience compared to many of the experienced chefs who prepare over-rated, overpriced, average meals that I tolerate at some of the nicer...More","starRating":"50","averageRating":0},{"fullName":"roblaz","postDate":"April 12, 2015","reviewTitle":"Finally made it there and it was worth the wait","postReview":"I have been wanting to eat here for years but the reservations / schedule never worked. Finally a friend made reservations for 8 people and we went. Well it was worth the wait. A beautiful setting, magnificent table near a class wall and windows. Everyone...More","starRating":"50","averageRating":0},{"fullName":"DeborahL428","postDate":"April 12, 2015","reviewTitle":"CIA at it's Finest","postReview":"Love the Culinary Institute and all it has to offer. The students did a great job working the front of the house, serving us, suggesting wines, engaging us without being obnoxious and prepared most of the food with perfection. The food was delicious. I wouldn't...More","starRating":"50","averageRating":0},{"fullName":"adrianafokshey","postDate":"March 17, 2015","reviewTitle":"One of my favorite Birthday dinners","postReview":"My husband took me here for my 30th birthday. Not only did I enjoy my meal, but the service was outstanding and we even got a tour of the kitchen where the students were cooking ( and all we had to do was ask and...More","starRating":"50","averageRating":0},{"fullName":"Fusion_Pilot","postDate":"March 12, 2015","reviewTitle":"Culinary Institute of America - excellent food and service, mostly.","postReview":"I wanted to rate this restaurant (part of the restaurants at the Culinary Institute of America in Hyde Park) as Excellent, and would have except for one minor slip-up during our visit. First, the facilities and restaurant are impeccable. The building is beautiful and maintenance...More","starRating":"40","averageRating":0},{"fullName":"Robyn P","postDate":"March 7, 2015","reviewTitle":"This Maryland family was treated like gold","postReview":"Our family of seven had a wonderful dinner. Our waiter, Danny, was spot on with his reccommendations for both appetizers and entrees. The mussels were plump perfection. The foie gras was creamy and full of flavor. One of us got the butternut squash soup and...More","starRating":"50","averageRating":0},{"fullName":"Barb_is_a_Foodie","postDate":"February 27, 2015","reviewTitle":"Birthday Celebration","postReview":"Been coming to the CIA restaurants for about 20 years now, in the past year I've been 3 other times. We were disappointed in two of the establishments and wasn't sure if we should give it another try. I'm glad we did and visited the...More","starRating":"50","averageRating":0},{"fullName":"Nicole B","postDate":"February 22, 2015","reviewTitle":"Good not Great","postReview":"Pros- cost, cocktails and portion size Best cocktails I've had in a while also food is bountiful, good size portionsI was pleasantly surprised when our bill came up to $153 ( which included a 17% gratuity) because we had four cocktails, two appetizers, two entree...More","starRating":"40","averageRating":0},{"fullName":"AlwaysWright315","postDate":"January 29, 2015","reviewTitle":"Outstanding meal presented, prepared and served by students of CIA.","postReview":"Culinary Institute of America has several restaurants. We choose American Bounty because of the variety of the menu. The whole experience took about 2 hours which was great to space out the courses. The food tasted great and looked marvelous. We even asked some questions...More","starRating":"50","averageRating":0},{"fullName":"kmdbike","postDate":"January 26, 2015","reviewTitle":"Oh So Good","postReview":"Our son graduated from the Culinary Institute of America this past weekend so I am somewhat bias in my review. That being said our dinner was fabulous. I had the duck which just melted in my mouth. If we ever have the opportunity again I...More","starRating":"50","averageRating":0},{"fullName":"JudyTroy_NY","postDate":"January 21, 2015","reviewTitle":"EVERYTHING WAS PERFECT","postReview":"Got an email regarding a winter special at the CIA's Hyde Park main restaurants--a choice of appetizer or salad or soup, entree, and dessert for $25 for lunch with 2 glasses of house special wine for $14. Made reservations for 3 through Open Table and...More","starRating":"50","averageRating":0},{"fullName":"NYAnge53","postDate":"January 15, 2015","reviewTitle":"Expected Better","postReview":"3 of us ate all courses. Soup was the best course. Scallop appy was very good. But my chicken was nothing special, neither was its side dishes. My daughter's swordfish was bland. Our wine was overpriced for the brand. Our waiter was good but it...More","starRating":"30","averageRating":0},{"fullName":"AllochkaG","postDate":"December 18, 2014","reviewTitle":"Worth the 2+ hour drive","postReview":"I was hesitant taking my 13 and 18 year old sons to this restaurant, but was hoping for the best. And rightfully so! As I may have mentioned in my previous reviews, my husband is a great cook, which makes it hard for us to...More","starRating":"50","averageRating":0},{"fullName":"shel29Brooklyn","postDate":"December 9, 2014","reviewTitle":"Great Service, Poor Food","postReview":"I was looking forward to the experience of eating at a Culinary Institute restaurant. Prices were comparable with well run and upscale restaurants. The service was great, perhaps too formal, and our student waiter was affable and attentive. The appetizer was good. The wine selection...More","starRating":"20","averageRating":0},{"fullName":"Dan T","postDate":"December 8, 2014","reviewTitle":"Did not meet expectations","postReview":"We were really looking forward to this meal because the menu and surroundings looked so promising. Sadly we were really disappointed in the food and to some extent the service. I know its a training kitchen but i think better supervision is needed because the...More","starRating":"30","averageRating":0},{"fullName":"ukhobo","postDate":"December 6, 2014","reviewTitle":"Good experience but could've been greatgreat","postReview":"The butternut squash soup is not to be missed. My husband and I both also ordered salads that were good and my husband also ordered a cheese plate. The problem was after the soups were served within a minute both of our salads and the...More","starRating":"40","averageRating":0},{"fullName":"TLK22939","postDate":"November 27, 2014","reviewTitle":"Lived Up to Expectations","postReview":"Had a wonderful meal with superior service. We made reservations for the first day of a new term, which, we were advised, might make for a less than perfect meal presentation or service. However, we were delighted with the atmosphere, food presentation, and service. We...More","starRating":"50","averageRating":0},{"fullName":"BHTravelbug","postDate":"November 16, 2014","reviewTitle":"Highly disappointing!","postReview":"I had read the less than favorable reviews on TA and thought 'those people must be really picky'. Actually those people were actually really correct! This was an experience I had long looked forward to, but sadly , it was not a good one. Firstly,...More","starRating":"20","averageRating":0},{"fullName":"PAL52772","postDate":"November 11, 2014","reviewTitle":"Everything 5 Star!","postReview":"From start to finish the service and meal was fantastic. As we've come to expect from the CIA restaurants, the attention to detail by servers and chef's alike is was stellar. The food came at just the right pace. We have found that each restaurant...More","starRating":"50","averageRating":0},{"fullName":"J5463FBkarenc","postDate":"October 26, 2014","reviewTitle":"Excellent food for slow lunch; accommodating service","postReview":"Expect excellent farm-to-table food and polite, accommodating but imperfect service. We were a party of 4 unable to get reservations online. I mistakenly thought the Apple Pie Cafe was open on weekends so we were already at the restaurants on campus. It was shortly before...More","starRating":"50","averageRating":0},{"fullName":"VoyageursUSA","postDate":"October 19, 2014","reviewTitle":"Less than we expected...","postReview":"The Culinary Institute of America is worth visiting. The campus is impressive and seeing the chefs-in-training in the teaching kitchens was enjoyable. We had great expectations for our meal at American Bounty. The menu and wine list were very inviting. The servers were friendly but...More","starRating":"30","averageRating":0},{"fullName":"barbara r","postDate":"October 13, 2014","reviewTitle":"Well done, but not as good as I was expecting","postReview":"Great ambience and good, but not great, food. All food prepared and served by students at the Culinary Institute of America (CIA). This is one of the two (and the better one in my opinion) restaurants at the CIA. The ambiance is white table cloth,...More","starRating":"40","averageRating":0},{"fullName":"Bob H","postDate":"October 12, 2014","reviewTitle":"Hard to Believe It's a School","postReview":"We had dinner here during our stay in Hyde Park. The entire experience reminded us of a fine dining restaurant in New York City, The ambiance was comfortable and the wide-ranging menu was fascinating. The service was beyond excellent and the staff was very attentive....More","starRating":"50","averageRating":0},{"fullName":"Thomas P","postDate":"October 9, 2014","reviewTitle":"Worth your visit","postReview":"While we would rate the American Bounty slightly lower than the school's French restaurant, as a stand alone, we would return in a minute. The food was excellent with creative uses of local products. The interaction with the CIA students added to the enjoyment without...More","starRating":"40","averageRating":0},{"fullName":"bikeKaren440","postDate":"October 4, 2014","reviewTitle":"CIA meal was on my \"bucket list\"","postReview":"We checked the menu for all the restaurants at the Culinary Institute before deciding on the American Bounty. Upon arrival, we were quickly shown to our table. Our server was pleasant, though he had to check with the kitchen staff to be sure the excellent...More","starRating":"50","averageRating":0},{"fullName":"AttnySteve","postDate":"September 28, 2014","reviewTitle":"This Can't Be the Future of Dining","postReview":"Four of us dined on a Saturday night at the American Bounty. First let me say that the surroundings were beautiful and got us excited for the meal to follow. Unfortunately, we were very disappointed. I had the scallop appetizer which turned out to be...More","starRating":"20","averageRating":0},{"fullName":"Lkwdtraveler23","postDate":"September 22, 2014","reviewTitle":"It is a school!","postReview":"We reserved for dinner and we're quickly shown to our table. Our server was inexperienced which was disappointing. He could not tell us about the Red Fish on the menu for instance which surprised us. We did enjoy our meals (Red Fish for my husband;...More","starRating":"40","averageRating":0},{"fullName":"Sallie F","postDate":"September 19, 2014","reviewTitle":"Best meal of our trip","postReview":"American Bounty was a highlight of this short trip. Food wonderful, service just exactly what we needed. Lovely elegant dining in the middle of the day. Don't miss the opportunity to eat at this culinary mecca.","starRating":"50","averageRating":0},{"fullName":"WednesdayNightGirl","postDate":"September 5, 2014","reviewTitle":"What a wonderful experience!","postReview":"Eight girlfriends on a road trip hit American Bounty, one of the training restaurants at the Culinary Institute of America. What a beautiful place! The campus is lovely and so is the building that houses the restaurants. We had a lovely meal - mussels, beef,...More","starRating":"40","averageRating":0},{"fullName":"redeco","postDate":"August 3, 2014","reviewTitle":"Outstanding Cuisine and Service","postReview":"Our visit to American Bounty had been planned for months with menu chosen for our group in advance. Expectations were high and the students at the Culinary Institute of America didn't disappoint! The dining room is impeccably decorated; the tables are set beautifully; and multiple...More","starRating":"50","averageRating":0},{"fullName":"conradb2","postDate":"July 26, 2014","reviewTitle":"Our 21st Anniversary!","postReview":"I've wanted to visit the CIA for many years and when my wife suggested it several months ago, it seemed like the perfect time to try it. It's only one and a half hours North, but we stayed overnight anyway. There are 3 restaurants available......More","starRating":"40","averageRating":0},{"fullName":"ScotsRoad555","postDate":"July 24, 2014","reviewTitle":"We only get to award 5 stars?","postReview":"What a treat. Being from the UK we were not quite sure what to expect from the Culinary Institute of America, or the American Bounty Restaurant. After being astonished at the huge size and scope of the Institute our meal surpassed our expectations. Staffed by...More","starRating":"50","averageRating":0},{"fullName":"Ty B","postDate":"July 23, 2014","reviewTitle":"Outstanding dinner","postReview":"Had wanted to visit the Culinary Institute of America (CIA) on previous visits to Hyde Park. Was finally able to make it for dinner in July 2014. Was not disappointed. Student chefs prepare exquisite meals. Service is outstanding. Prices are a bit high. No tipping...More","starRating":"40","averageRating":0},{"fullName":"Chuck V","postDate":"July 21, 2014","reviewTitle":"Great food and service","postReview":"My wife rec'd a gift card for the Culinary Institute and we drove 1+ hrs. to get there. We were not disappointed. The food and service we excellent. A bit pricey but worth it. We're coming back in the fall to try the Italian restaurant.","starRating":"40","averageRating":0},{"fullName":"Jarred W","postDate":"July 21, 2014","reviewTitle":"Tasty but not at all fussy","postReview":"I don't tend to like involved restaurant experiences. I like good food, but I'm not a fan of all the other \"stuff\" that comes along with a \"nice\" restaurant. American Bounty was perfect. It was delicious, the staff was all nice, but it was not...More","starRating":"50","averageRating":0},{"fullName":"YogaMamas","postDate":"July 19, 2014","reviewTitle":"Well Done","postReview":"I was skeptical after having had a disappointing meal at Bocuse about a year and a half ago but this fare did not disappoint! Attentive service, perfect seasonings, varied flavors made for a wonderful lunch experience!","starRating":"50","averageRating":0},{"fullName":"HikerTraveler","postDate":"July 14, 2014","reviewTitle":"Great food prepared and served by students","postReview":"The restaurant is one of a number inside the Culinary Institute of America. One side of the restaurant faces the lovely grounds, the other side surrounds a large window where you can look in on the students and instructors as they prepare meals. I must...More","starRating":"40","averageRating":0},{"fullName":"Momacita","postDate":"July 14, 2014","reviewTitle":"Great experience","postReview":"Everyone we meet at the Culinary Institute was so friendly and accommodating it made the entire experience that much more pleasurable. The had a delicious meal and although our waiter seemed a bit nervous, he was wonderful.","starRating":"40","averageRating":0},{"fullName":"MarkO95","postDate":"July 13, 2014","reviewTitle":"The Culinary Institute of America-a BIG disapointment!","postReview":"In great anticipation we had made reservations for the American Bounty Restaurant. The staff was friendly, however our server was not at the level of knowledge regarding the fish offers, or the wine. The salad for $9.00 was average, the scallop special also for that...More","starRating":"30","averageRating":0},{"fullName":"Frank C","postDate":"July 13, 2014","reviewTitle":"Not their best day","postReview":"The American Bounty restaurant is one of the restaurant labs on the campus of the Culinary Institute of America. The restaurant is beautifully appointed as are they all. Students work the kitchen and dining room under the guidance of faculty. The food was generally good...More","starRating":"30","averageRating":0},{"fullName":"Bfranz","postDate":"July 9, 2014","reviewTitle":"Disappointed :(","postReview":"We travelled from NYC specifically to eat here and I was so disappointed. Even making allowances for the service being students- aren't many waiters students?- they were slow and seemed confused. No one bothered to explain the iPad wine list (I only knew it was...More","starRating":"20","averageRating":0},{"fullName":"travelsalot6285","postDate":"June 19, 2014","reviewTitle":"Disappointed","postReview":"We have dined here on several previous occasions and were always very pleased with the food and service. Unfortunately our experience this time was disappointing. The food (sea bass and roast chicken) was tasteless. The service was slow and inattentive. Since we needed to ask...More","starRating":"20","averageRating":0},{"fullName":"CarolinaBecky","postDate":"June 17, 2014","reviewTitle":"Bounty beautifully prepared and presented","postReview":"American Bounty is CIA's farm to table restaurant focusing on American food. I was pleasantly surprised by how delightful the meal was, enhanced by wonderful, warm and gracious service. Service and food are done by students; it's impressive how enthusiastic they seemed about their program...More","starRating":"50","averageRating":0},{"fullName":"OpinionatedFoodie","postDate":"June 17, 2014","reviewTitle":"A great place to celebrate with friends","postReview":"My college classmates went to dinner there during our reunion and had a spectacular dinner. We lingered for three hours and never once felt that we needed to leave. The service was friendly, though a bit uneven (they are students, after all). The menu was...More","starRating":"50","averageRating":0},{"fullName":"stefhim","postDate":"June 14, 2014","reviewTitle":"CIA incredible meal & experience.","postReview":"Recommendations by our server were spot on - the invite into the kitchen was a bonus. One short rib meal was very fatty, the other was perfect.","starRating":"50","averageRating":0},{"fullName":"rhtrips333","postDate":"June 2, 2014","reviewTitle":"Amazing Food! Want to try the other restaurants now","postReview":"My wife and I are food fanatics and traveled to the CIA to try the American Bounty restaurant. Students did a great job! The foie gras app and sausage & sauerkraut apps were fantastic, very clean flavors and not heavy at all. The Short Rib...More","starRating":"50","averageRating":0},{"fullName":"Mimikids","postDate":"May 24, 2014","reviewTitle":"An experience not to be missed!","postReview":"My husband and I and several friends have eaten at American Bounty many times. We have never been disappointed in any way. The students are delightful to talk with. The presentation is beautiful and food is beyond delicious. They even have gluten free bread/rolls and...More","starRating":"50","averageRating":0},{"fullName":"chutneyluv","postDate":"May 20, 2014","reviewTitle":"Disappointing","postReview":"We made reservations for lunch at American Bounty. The servers did a decent job, but the food was unmemorable. I ordered the roast beet salad which was artfully plated, but so bland that I had to add salt. My friend ordered a Caesar salad. It...More","starRating":"30","averageRating":0},{"fullName":"Seniors57558","postDate":"May 18, 2014","reviewTitle":"Rewarding Experience","postReview":"While on a quick trip to the Hudson Valley we were able to get a dinner reservation for the American Bounty Restaurant, part of the Culinary Institute's chain of campus restaurants. Students prepared and served our meal while we pelted them with questions about their...More","starRating":"50","averageRating":0},{"fullName":"garyW4144XV","postDate":"May 16, 2014","reviewTitle":"\"emperor without clothes\"","postReview":"I ate at the American Bounty with my wife and daughter yesterday for lunch. It was one of the worst experiences in service I have had in an upscale restaurant. I do understand that the students are in training but where was the floor manager...More","starRating":"30","averageRating":0},{"fullName":"Pamahler","postDate":"April 27, 2014","reviewTitle":"Wonderful Experience","postReview":"My husband and I recently dined at the American Bounty after a tour of the Institute that was very enjoyable. From the minute we arrived, the staff could not do enough to make our evening more pleasurable. We found the students attentive and interesting. They...More","starRating":"50","averageRating":0},{"fullName":"Rhapsodyinblue","postDate":"April 7, 2014","reviewTitle":"Remember, it's a classroom too!","postReview":"We met a group of family here for a mini reunion. We were seated quickly, the dining room has a nice ambiance. From the beginning, we could tell that our waitress was overwhelmed, unsure if she was just learning, or if the amount of tables...More","starRating":"40","averageRating":0},{"fullName":"Taster152","postDate":"April 6, 2014","reviewTitle":"Good lunch","postReview":"Went to the CIA for the fourth time this past Saturday. Food is great. That is why you go! Service needs some fine tuning. But these students are not meant to be servers. That being said, manager himself should have a little more control of...More","starRating":"40","averageRating":0},{"fullName":"Holly M","postDate":"March 21, 2014","reviewTitle":"Great dinner","postReview":"We greatly enjoyed our dinner, the taste and creativity of the meal was excellent as was the service and ambiance, all the more exceptional that this was all done by students at the CIA.","starRating":"50","averageRating":0},{"fullName":"Linda02813","postDate":"January 10, 2014","reviewTitle":"Wonderful meal and beautiful surroundings","postReview":"This restaurant is one of four in the Culinary Institute of America, Hyde Park. This was our first time in the area and a friend had told us about the restaurants so we made a point of dining at American Bounty. Not a mistake; the...More","starRating":"50","averageRating":0},{"fullName":"missalonghi","postDate":"November 27, 2013","reviewTitle":"Memorable venue, delightful BFF getaway splurge","postReview":"We were not deterred by reviews mentioning uneven service and were not disappointed. We enjoyed a tour of the CIA prior to this dinner. The restaurants's room is a showplace of the CIA (a former monastery) and we had a lovely deuce. (If I had...More","starRating":"50","averageRating":0},{"fullName":"SquareG","postDate":"November 16, 2013","reviewTitle":"Somewhat of a disappointment this time","postReview":"The location, decor, etc., have been adequately described by others, so I am not going to go into that. I will talk about food and service. I have been to the American Bounty several times, always experiencing a great meal in the past. My most...More","starRating":"40","averageRating":0},{"fullName":"Randy M","postDate":"November 14, 2013","reviewTitle":"Didn't Know What to Expect","postReview":"Made reservations a while back for a Wednesday evening during Hudson Valley Restaurant week. Didn't know what to expect on menu, or whether it might be busy, rushed, and crowded. Much to my surprise it turned out to be an almost flawless dining experience. Service...More","starRating":"50","averageRating":0},{"fullName":"KnittingNut53110","postDate":"November 9, 2013","reviewTitle":"Nothing could have been any better!","postReview":"We arrived without a reservation and first were turned away. but when the head chef learned we came all the way from WI (he kidded us for driving non-stop just to eat there) he asked the maitre'd to accommodate us. The experience was unparalleled from...More","starRating":"50","averageRating":0},{"fullName":"Taosnm2011Us","postDate":"November 3, 2013","reviewTitle":"i must experience dinning event","postReview":"this restaurant is one of four venues in the \"culinary institute of america. the service, food prep, management and all phases of the operation are syperbly done by students in the Institute. we have enjoyed meals here twicw and each time was a joy. their...More","starRating":"50","averageRating":0},{"fullName":"Kibblesdad","postDate":"November 2, 2013","reviewTitle":"A Hidden Treasure","postReview":"Top notch food and service presented by enthusiastic students. Me and my wife have dined here twice and we can't say enough good things about it. The atmosphere is comfortable, and the service is friendly presented by eager students. Ask them about the food and...More","starRating":"50","averageRating":0},{"fullName":"Calhu","postDate":"November 2, 2013","reviewTitle":"Enjoyable Evening","postReview":"We had made a reservation here several weeks earlier as part of our stay in Hyde Park. Reservations are now made through Open Table and do not require a deposit of $10/person as used to be the case. We were seated promptly and our student...More","starRating":"40","averageRating":0},{"fullName":"PhiladelphiaSbb123","postDate":"October 27, 2013","reviewTitle":"Wonderful experience","postReview":"Restaurant is part of the CIA it's classic American with creativity in its menu. Service and atmosphere excellent. Well worth the 3 hour drive from my home!","starRating":"50","averageRating":0},{"fullName":"SLP v","postDate":"October 18, 2013","reviewTitle":"Make a reservation and plan a trip to the Hudson Valley!","postReview":"This was a celebration birthday dinner with my best friend as part of a girl's getaway. Prior to dinner we enjoyed the lovely grounds, 4 p.m. tour (well worth doing - approx 1 hr long and $6 per person), a drink in the lounge area...More","starRating":"50","averageRating":0},{"fullName":"E6735JJpaull","postDate":"October 13, 2013","reviewTitle":"superb meal, lovely setting, wait staff learning","postReview":"went to AB for dinner with my mother. lovely meal. excellence all around in terms of food quality. dining room was terrific (old world, classic look). the grounds of the restaurants/school were very nice to walk around in. for two apps, two glasses of wine,...More","starRating":"50","averageRating":0},{"fullName":"Dave B","postDate":"October 12, 2013","reviewTitle":"CIA American Bounty does not disappoint","postReview":"We had originally booked 3 nights at a B&B in Hyde Park, NY, in order to visit the FDR home and museum, and to have dinner at the CIA. Shortly before we were to arrive, the proprietress called and very apologetically said that she had...More","starRating":"40","averageRating":0},{"fullName":"madmprez","postDate":"September 29, 2013","reviewTitle":"Disappointed","postReview":"I thought with being associated with the CIA that we were in for a memorable evening. But the food was just OK, service was well intentioned but amateur. We are not locals but would not recommend to anyone else.","starRating":"30","averageRating":0},{"fullName":"Joyce S","postDate":"September 26, 2013","reviewTitle":"Very uneven dining experience but a beautiful setting","postReview":"My friend and I had lunch at American Bounty on Thursday afternoon, Sept. 26. The campus and the architectural splendor of this former monastery were simply stunning. The interior of American Bounty is particularly beautiful ----the place deserves a Michelin star for that alone. However,...More","starRating":"30","averageRating":0},{"fullName":"Linda W","postDate":"September 25, 2013","reviewTitle":"American Bounty: Not too bountiful & not that tasty","postReview":"Once we turned into the Culinary Institute we were baffled as to where the restaurant and parking were located. Signage was minimal and without the help of a passing student, we might still be driving around! We'd been told men had to wear jackets which...More","starRating":"30","averageRating":0},{"fullName":"Ana2Sept2015","postDate":"September 12, 2013","reviewTitle":"Excellent Service, Good Food","postReview":"We dined at the American Bounty at the Culinary Institute of America on 9/6/2013. All appetizers and dishes were quite delicious, except for the rib eye and potato dish which was too salty. The rest of our meals fish, steak, and deserts were very satisfying....More","starRating":"40","averageRating":0},{"fullName":"Diane W","postDate":"September 12, 2013","reviewTitle":"Culinary Adventure","postReview":"Local residents recommended I try eating at the Culinary Institute of America so I had dinner at the American Bounty Restaurant on the campus. It was a fun adventure. It wasn't the best meal I have had in a restaurant, but the food was very...More","starRating":"40","averageRating":0},{"fullName":"Katherine M","postDate":"September 4, 2013","reviewTitle":"The Next Generation - Looking Good!","postReview":"You'll see the next generation of great chefs at American Bounty, one of the restaurants run by students at the Culinary Institute of America. My son and I dined here while visiting colleges in the area. Our meal was highly enjoyable, with excellent service, very...More","starRating":"40","averageRating":0},{"fullName":"Bob423","postDate":"September 1, 2013","reviewTitle":"I expected more for $179 for two","postReview":"At $179 for dinner with one cocktail and a glass of wine each, I expected an experience similar to a restaurants I've dined at in Paris, especially with CIA's reputation. However, it was not to be. We ordered cocktails before dinner but endured a 15...More","starRating":"30","averageRating":0},{"fullName":"paul7241","postDate":"August 26, 2013","reviewTitle":"The students all get A+","postReview":"We recently dined at The American Bounty Restaurant (one of the student run restaurants at the Culiniary Institute of America (CIA)) to celebrate my daughter in laws birthday. The service, atmosphere and food were all over the top. The wait staff was attentive but not...More","starRating":"50","averageRating":0},{"fullName":"379barbr","postDate":"August 23, 2013","reviewTitle":"Very disappointing","postReview":"To say the least this was one of the most disappointing meals i have ever had. Our server was charming and meant well but the food was mediocre at best. Our meal cost a small fortune and when we expressed some of our concerns the...More","starRating":"10","averageRating":0},{"fullName":"IraS674","postDate":"August 6, 2013","reviewTitle":"Fabulous meal","postReview":"My wife and I had a really memorable meal tonight at this restaurant. The service was excellent, the food delicious, and presentation superb! If you are planning to be in this area you must eat here. Also, the tour is very interesting if you are...More","starRating":"50","averageRating":0},{"fullName":"WalterV15","postDate":"August 5, 2013","reviewTitle":"A Hudson Valley Gem","postReview":"Actually, CIA has a wonderful collection of student-staffed restaurant \"gems\" , American Bounty not being the least such. The setting, a stately brick and wood paneled set of rooms surrounding a courtyard in an imposing classical building on a beautiful campus establishes a wonderfully dignified...More","starRating":"40","averageRating":0},{"fullName":"Gerald R","postDate":"July 20, 2013","reviewTitle":"Great restaurant","postReview":"As we expected from C.I.A., the food was excellent and the service was wonderful. Remember, the servers are students in training and may be brand new. Our server needed a little more training, but when talking to her, she told us her main interest is...More","starRating":"50","averageRating":0},{"fullName":"NCRedhead105","postDate":"July 13, 2013","reviewTitle":"Excellent Meal at the CIA","postReview":"Made the reservations months in advance so we were looking forward to a great meal and we weren't disappointed! Excellenct service and food! Looking forward to returning next time we are in NY!","starRating":"50","averageRating":0},{"fullName":"yellowlabmom","postDate":"June 26, 2013","reviewTitle":"Expensive, but worth it","postReview":"This was a wonderful experience. Beautiful setting, great food and service. Our waiter was a delight to talk to, both about the program and the night's offerings. Neat wine list and fun cocktail offerings. I liked that the menu pairs wines with the entrees. I...More","starRating":"50","averageRating":0},{"fullName":"practans","postDate":"June 25, 2013","reviewTitle":"Worthy of its Renown","postReview":"After having friends tell us how nice it was to have dinner at the Culinary Institute of America in Hyde Park, we finally did it during a visit to the Hudson Valley. We reserved at American Bounty rather than The Bocuse Restaurant. Our meal was...More","starRating":"50","averageRating":0},{"fullName":"Leslie W","postDate":"June 22, 2013","reviewTitle":"A bit rushed","postReview":"We had an early reservation to celebrate our anniversary, and were given a table with a view of the kitchen; is this perk or punishment? The mojitos tasted as if they were made with Sprite, and there was no discernible rum or fresh mint (although...More","starRating":"40","averageRating":0},{"fullName":"Albany_NY_Brad","postDate":"June 12, 2013","reviewTitle":"American Bounty: perfect as usual.","postReview":"My wife and I have attended restaurants at the CIA since the 80's when we lived in Dutchess County. Even after we moved to Vermont we made trips to the CIA for special occasions. A few years ago we moved to the Albany, NY area...More","starRating":"50","averageRating":0},{"fullName":"eshattuck","postDate":"June 3, 2013","reviewTitle":"Great Food and Ambiance","postReview":"This was our second dinner at the CIA, having dined at Bocuse the evening before. The restaurant was smaller than anticipated and quite unpretentious. Our waiter seemed a bit overwhelmed and took way too long, in my opinion, getting the basics done - water, menus...More","starRating":"40","averageRating":0},{"fullName":"SherandPat","postDate":"May 29, 2013","reviewTitle":"Good dinner","postReview":"We had dinner here the day after eating at Bocuse so we were spoiled by the food there. The food at American Bounty was good but on a different level. The service was good but more uneven than the previous night. We liked supporting the...More","starRating":"30","averageRating":0},{"fullName":"Ken D","postDate":"May 28, 2013","reviewTitle":"Delicious and fun","postReview":"My wife and I dined at the American Bounty at the Culinary Institute of America. We experienced first-class service provided by the students. Our meals were absolutely delicious and prepared to perfection. It was fun talking to the students about their time at the school...More","starRating":"50","averageRating":0},{"fullName":"WestchesterP2","postDate":"May 24, 2013","reviewTitle":"What an experience!","postReview":"Had lunch at American Bounty. Food was delicious and well presented. Even though it was pouring rain, it was still worth the 50 mile drive. The Culinary Institute of America has a great reputation and for good reason. Honestly, it wasn't 100% perfect but if...More","starRating":"40","averageRating":0},{"fullName":"pps_10","postDate":"May 17, 2013","reviewTitle":"Amazing Food","postReview":"It is just as good as its reputation. Food is creative and well made. Waiters are eager to help. Scallops were excellent. Also the cheesecake.","starRating":"50","averageRating":0},{"fullName":"MMWScott","postDate":"May 16, 2013","reviewTitle":"Unique, Fun, and Delicious Dining Experience","postReview":"First, I have to say that I wasn't quite sure what to expect after reading some of the reviews on here. I was very excited about eating at American Bounty, but some of the harsh reviews on TA had me nervous. Let me say that...More","starRating":"50","averageRating":0},{"fullName":"Lweisman224","postDate":"May 1, 2013","reviewTitle":"It was so good we went twice!","postReview":"We had gone here on a previous anniversary trip and were floored by the service and the food prepared by these students. The second time we went back we were equally impressed.","starRating":"50","averageRating":0},{"fullName":"awesome1jh","postDate":"April 30, 2013","reviewTitle":"Better food at outback and much cheaper","postReview":"The steak was thin and not very tasty. The braised short ribs were nothing special. Prices were very high for mediocre food.","starRating":"20","averageRating":0},{"fullName":"tm s","postDate":"April 29, 2013","reviewTitle":"A culinary delight","postReview":"We reserved a month in advance and were not disappointed. A very informative waiter presented all the menu choices and delivered all of our courses in a spectacular way. From the salads and appetizers to the cornbread and assorted breads, to the main courses, desserts,...More","starRating":"50","averageRating":0},{"fullName":"Zha-MD","postDate":"April 25, 2013","reviewTitle":"CIA should be ashamed!!","postReview":"First of all, the food and service would be considered average to poor anywhere else; but come on folks. This is where we are training the next generation of culinary experts, for crying out loud. The school is backed by some of the best in...More","starRating":"10","averageRating":0},{"fullName":"GMMiele","postDate":"April 15, 2013","reviewTitle":"Highly Enjoyable - tables always available weekdays!!","postReview":"Went for lunch, tried some items that I wouldn't normally order (duck terrine with pistachios, fennel salad, etc) and it was interesting. The bread and sliced steak was exceptional. Students are serving & it's impeccable. They have windows all around the CIA thru which you...More","starRating":"40","averageRating":0},{"fullName":"ppipub","postDate":"April 10, 2013","reviewTitle":"A cooking school serves up some good eats","postReview":"Set on the campus of the now famous school you will find this restaurant. Reservations are a must. Also, consider arriving a couple of hours early and take the tour. Advance reservations are needed for both. The food is nicely prepared and the master chefs...More","starRating":"40","averageRating":0},{"fullName":"MonicaMooresville","postDate":"April 8, 2013","reviewTitle":"Unanticipated delight","postReview":"Our original plan was to tour the Roosevelt & Vanderbilt homes, and then I ran across the CIA online. Two days before our arrival, I was able to reserve lunch for two due to a cancellation. Because of the travel time from NYC & a...More","starRating":"50","averageRating":0},{"fullName":"Mom2Boys","postDate":"March 29, 2013","reviewTitle":"Outstanding Service, but Disappointed","postReview":"We were very eager to eat at the Culinary Institute while we were visiting the sites and our son's friend who is a student there. She had recommended the American Bounty since it was the nicest of all the restaurants. Yes, it was lovely. Decor...More","starRating":"30","averageRating":0},{"fullName":"drmobo","postDate":"March 27, 2013","reviewTitle":"Not exactly what you'd think","postReview":"The American Bounty venue at CIA has it's heart in the right place. The food is a little overwrought, but tasty overall. The reservation system IS a drag, as others have mentioned, but despite it it's still hard to get a table.The waiters are all...More","starRating":"40","averageRating":0},{"fullName":"Ernest A","postDate":"March 19, 2013","reviewTitle":"The Other CIA at Work","postReview":"American Bounty is a student restaurant operated by the Culinary Institute of America's future super stars. It is an uneven experience; however, very much worth the while and unique inasmuch as the types and quality of the food is constantly changing and being prepared and...More","starRating":"50","averageRating":0},{"fullName":"GilBagnell","postDate":"March 7, 2013","reviewTitle":"A Note on Making Reservations at CIA","postReview":"We previously reviewed this restaurant very favorably, plus the others at the CIA. I add this note to caution that the reservations desk at the CIA does NOT seem to be well managed, because we often get pushback in making reservations and it is difficult...More","starRating":"50","averageRating":0},{"fullName":"cwaNy","postDate":"March 1, 2013","reviewTitle":"A very special experience","postReview":"The food is spectacular and knowing that it is being prepared and served by some of the best 'future' chefs in the world makes dining at the CIA memorable. Be sure to visit the bookstore and walk the school corridors - you can see some...More","starRating":"50","averageRating":0},{"fullName":"rokamabe","postDate":"February 25, 2013","reviewTitle":"So much fun","postReview":"Having heard about this place for years we were so happy to finally have a dinner here. With another couple we first had drinks at the bar. Perfectly executed vodka gimlet and cosmopolitans. Dinner was delicious from start to finish with very helpful young waiters...More","starRating":"50","averageRating":0},{"fullName":"SquareG","postDate":"February 9, 2013","reviewTitle":"Superb food, great value !","postReview":"We went to have the three course prix fixe dinner, which is $30, offered January thru March. Elegant setting. We were pleasantly surprised that virtually everything on the á la carte listing was available as a prix fixe selection. I chose the Sautéed Shrimp and...More","starRating":"50","averageRating":0},{"fullName":"HudsonRiverLooker","postDate":"January 25, 2013","reviewTitle":"American cuisine","postReview":"The Bounty is one of the restaurants at the CIA, and some would say it's the best. The emphasis is elegant dining on American cuisine, using American products. The service is perfect, and the food is absolutely fantastic all the time. Get a meal here,...More","starRating":"50","averageRating":0},{"fullName":"roseswithribbons","postDate":"January 11, 2013","reviewTitle":"Exquisite presentation, extraordinary preparation, remarkable value","postReview":"As a former nationally-acclaimed restaurateur, I feel totally qualified to recommend this dining experience as one of the premier dining experiences one can find, rivaling the finest NYC restaurants. Buttermilk fried oysters, Mussels in Coconut-Curry broth, Red Wine Braised Short Ribs, poblano shortbread biscuits, every...More","starRating":"50","averageRating":0},{"fullName":"StarWeez","postDate":"January 1, 2013","reviewTitle":"MUTINY AT THE AMERICAN BOUNTY ROOM","postReview":"I have dined at various CIA restaurants since 1978. Until our most recent trip, we always enjoyed the cuisine, talking with the students and staff, and trying new foods. When we dined at the American Bounty Room in September 2012, however, we were quite disappointed...More","starRating":"20","averageRating":0},{"fullName":"pasbuffalo","postDate":"November 22, 2012","reviewTitle":"A wonderful special occasion dinner!","postReview":"The companion and I dined at this CIA restaurant last week for my birthday dinner. Service and food were exceptional. We were offered an assortment of freshly basked breads to start. The companion chose PEI mussels for his appetizer, which he thoroughly enjoyed. I ordered...More","starRating":"50","averageRating":0},{"fullName":"Maria C","postDate":"November 20, 2012","reviewTitle":"Good Points and OK points.","postReview":"We went with a bus trip for a tour of CIA and lunch. We started with butternut squash soup which was excellent and I am not a fan of butternut squash anything. Our entree was braised short ribs, garlic mashed potatoes and spinach. Again it...More","starRating":"40","averageRating":0},{"fullName":"Walkinggranny","postDate":"November 13, 2012","reviewTitle":"Great food but slightly off service","postReview":"I know this is the restaurant for the students of the Culinary Institute and that they are still learning, but if they are going to invite us in to taste and comment on the food, which was fabulous, they must also give the students some...More","starRating":"50","averageRating":0},{"fullName":"Fran_HudsonValley_NY","postDate":"November 10, 2012","reviewTitle":"City fare at country prices","postReview":"this is one of the gourmet restaurants that is part of the Culinary Institute of America. Just before graduating from a rigorous culinary education, the students staff the flagship restaurants to showcase what they have learned. I always choose this to treat favorite out-of-town guests.","starRating":"50","averageRating":0},{"fullName":"droffilc","postDate":"November 10, 2012","reviewTitle":"Future chef's and restauranteurs at jeopardy?","postReview":"First I realize that this is a school operated dining room. But these are seniors who are the servers and in the kitchen--they were graduating the next day. And each section of the restaurant is supervised by accomplished instructors who hopefully are committed and watchful...More","starRating":"20","averageRating":0},{"fullName":"Jim2525","postDate":"November 8, 2012","reviewTitle":"Nice atmosphere","postReview":"Pretty good food choices on the seasonal menus. Portions are small and service is iffy, but overall a great place to dine.","starRating":"40","averageRating":0},{"fullName":"Jason J","postDate":"November 5, 2012","reviewTitle":"simply wonderful","postReview":"Went there this weekend, in the aftermath of Hurricane Sandy... What a nice relief to have great, attentive service. Every one of the staff was there to help! They were knowledgeable and informed. Always there if you needed them, and discreet if you wanted privacy....More","starRating":"50","averageRating":0},{"fullName":"SailorGrl103","postDate":"November 5, 2012","reviewTitle":"Great atmosphere and excellent lunch selections","postReview":"We recently celebrated my mothers birthday at the American Bounty for lunch. The selection of food, beverage, and desserts were just right - as they were not overwhelming and everything on the menu looked fabulous. I really like the soup sampler - where you get...More","starRating":"50","averageRating":0},{"fullName":"Das4545","postDate":"October 12, 2012","reviewTitle":"Fabulous Lunch","postReview":"We had lunch in American Bounty. Beautiful room, outstanding service. As good as any restaurant anywhere. I had the mussels appetizer and the duck. The sauce with the mussels was outstanding. The duck was perfectly prepared and accompanied by a very tasty hummus. The caramel...More","starRating":"50","averageRating":0},{"fullName":"DrCICS","postDate":"October 11, 2012","reviewTitle":"CIA School run 5 star dinning at a reasonable price","postReview":"of the restaurants at the CIA school, this one is by far my favorite. The food is always excellent, as well as the appetizers and deserts","starRating":"50","averageRating":0},{"fullName":"TravelerNYC-1","postDate":"October 7, 2012","reviewTitle":"Wonderful Hudson Valley Experience","postReview":"I have been going to the Culinary Institute for many years. It is always interesting and rewarding. The students are easy to talk speak with and openly share their experiences and plans. The grounds are beautiful and provide wonderful views of the Hudson River, especially...More","starRating":"50","averageRating":0},{"fullName":"kgnbuff","postDate":"September 27, 2012","reviewTitle":"The Best of the CIA","postReview":"Great menu, service and atmosphere. Sited within the Culinary Institute of America, the restaurant is staffed by students who work hard to make the meal a treat","starRating":"50","averageRating":0},{"fullName":"Jim C","postDate":"September 6, 2012","reviewTitle":"The meal of a lifetime!","postReview":"It was very easy to get mid-week dinner reservations and after enjoying the 4pm campus tour, our appetite was whetted for what promised to be an excellent meal. We were not disappointed! We enjoyed an Appetizer, Salad, Entree, Cheese course and desert. The bill for...More","starRating":"50","averageRating":0},{"fullName":"Aescalapeus","postDate":"August 20, 2012","reviewTitle":"An Experience","postReview":"Last time I was there, I had taken a friend to celebrate her new citizenship. We went for lunch, had no alcoholic drinks, and the bill was in excess of $90 for lamb chops. The meal was well prepared and the service what you would...More","starRating":"40","averageRating":0},{"fullName":"oritkis","postDate":"August 17, 2012","reviewTitle":"A great lunch","postReview":"We took the tour of the CIA the say before and lunched in the restaurant the day after. The restaurant is very fancy - a bit too much for me and my family. However, once we received our dishes - everything was of the highest...More","starRating":"50","averageRating":0},{"fullName":"LovinHotelLife","postDate":"August 15, 2012","reviewTitle":"One of the best meals of the year","postReview":"Wow. I am not often as pleasantly surprised as I was at the CIA's American Bounty restaurant. This restaurant is an award winning restaurant that focuses on the flavors and ingredients of the United States. I know it is probably not as popular as the...More","starRating":"50","averageRating":0},{"fullName":"aubreyrich","postDate":"August 2, 2012","reviewTitle":"Great experience","postReview":"We ate both lunch and dinner at the American Bounty. The service was great! The kids were delightful and for a group of young aspiring chefs, they really do an outstanding job. Lunch was a lighter serving, as is customary, with dinner being much too...More","starRating":"50","averageRating":0},{"fullName":"BikerEd","postDate":"July 9, 2012","reviewTitle":"Wonderful Experience -- And not overpriced","postReview":"We dined at the American Bounty restaurant at the CIA and enjoyed the food, service and decor. The students were very knowledgeable about all the preparations and had good recommendations. I was surprise that the prices were generally reasonable for such an upscale restaurant. The...More","starRating":"50","averageRating":0},{"fullName":"SusanL938","postDate":"July 6, 2012","reviewTitle":"Excellent food","postReview":"The food was excellent,but a little pricey. We both had chicken with mashed potatoes and peas. Now this is comfort food that I could probably make just as good at home, but it was $27 each.","starRating":"50","averageRating":0},{"fullName":"Janet N","postDate":"July 6, 2012","reviewTitle":"Dinner","postReview":"This is one of the CIA restaurants that I visit on a regular basis. I like the local ingredients and the students are wonderful.","starRating":"50","averageRating":0},{"fullName":"lexdee","postDate":"June 28, 2012","reviewTitle":"A Different CIA (Culinary Institute of America)","postReview":"I rated it excellent because it is. Attentive well-paced service, sophisticated wine list, a menu that really had some difficult choices and the food, oh, yes....the best scallops I have ever eaten in my 79 years on this planet. I'm not picky, I hate to...More","starRating":"50","averageRating":0},{"fullName":"Beeper99_12","postDate":"June 27, 2012","reviewTitle":"Wonderful experience","postReview":"Our party had a wonderful experience at the American Bounty. The servers were very friendly and attentive, the ambience was very appealing, and the food was exceptional. We really enjoyed our visit to this restaurant, and we look forward to returning again.","starRating":"50","averageRating":0},{"fullName":"winchesterman","postDate":"June 18, 2012","reviewTitle":"A memorable dining experience.","postReview":"We were visiting Hyde Park and decided to try this restaurant. We made a reservation and were asked if we had any dietary requirements. We said that two of our party needed gluten free food. On arrival, our server had a note of this and...More","starRating":"50","averageRating":0},{"fullName":"DanavH","postDate":"May 15, 2012","reviewTitle":"First-class meal and service.","postReview":"The American Bounty is one of the final service experiences for students of the Culinary Institute of America and provides a unique experience for diners. The menus are creative, and the entire dining experience is memorable. Highly recommended.","starRating":"50","averageRating":0},{"fullName":"Avalon-Wine","postDate":"May 8, 2012","reviewTitle":"Great food","postReview":"Food was very good. Service was friendly but I was surprised it lacked some of the finer skills of high-level restaurants - the kind of things found in Michelin-starred establishments that I would have thought the CIA would have taught the kids. However, since the...More","starRating":"40","averageRating":0},{"fullName":"Joni C","postDate":"April 27, 2012","reviewTitle":"amazing","postReview":"Love the CIA. Some of the best food and service we've ever gotten has been at the CIA. AMAZING.","starRating":"50","averageRating":0},{"fullName":"Mickey G","postDate":"April 24, 2012","reviewTitle":"And students do the cooking","postReview":"A nice leisurely drive up to CIA or take the train for even a more relaxing day. The restaurnts are run by students at the direction of instructors. The service is attentive and the food is amazing good. You will delitefully surprised by how well...More","starRating":"50","averageRating":0},{"fullName":"pattyrn62","postDate":"April 23, 2012","reviewTitle":"Wonderful birthday lunch","postReview":"For my 50th birthday my boyfriend took me to CIA for a special lunch on our way to the Berkshires(a little out of the way but so worth it). We chose this restaurant at the recommendation by my cousin, a 1987 graduate of the school....More","starRating":"50","averageRating":0},{"fullName":"ThisMamasMiles","postDate":"April 20, 2012","reviewTitle":"What a great dining experience!","postReview":"The CIA trains the world's greatest chefs, so to enjoy a meal prepared and served by the students- it's a very pleasurable experience!","starRating":"50","averageRating":0},{"fullName":"IAmNotAnArchitect","postDate":"April 19, 2012","reviewTitle":"Best meal I've had a long while","postReview":"I like me some expensive food, since it usually means it's quality, but down in New York City that doesn't always hold. For the price of a slightly expensive lunch, with a low automatic gratuity, I was treated to a delicious meal that I could...More","starRating":"50","averageRating":0},{"fullName":"tappantoby","postDate":"March 24, 2012","reviewTitle":"A EPICURIAN DELIGHT AND EXCELLENT SERVICE","postReview":"We arrived at noon and were immediately seated near the large windowed kitchen in full view of desserts being made. WOW. We decided to take advantage of the special 3 course $22 special and it was wonderful. The excellent service and fine food made this...More","starRating":"50","averageRating":0},{"fullName":"VincentvanGoGo","postDate":"March 17, 2012","reviewTitle":"Uneven Experience","postReview":"I had been anticipating for many years a trip to the CIA and its restaurants but until recently hadn't found a justification for the two hour drive. The place is literally a campus with a splendid vista overlooking the Hudson River. The grounds and buildings...More","starRating":"30","averageRating":0},{"fullName":"AmyDesi","postDate":"February 26, 2012","reviewTitle":"Higlights of the trip","postReview":"I went to American Bounty Restaurant at the Culinary Institute of America in Hyde Park New York. There were 4 of us in the party. The food is very nice, especially the deserts. Other than the food, I am very impressed by the passion of...More","starRating":"50","averageRating":0},{"fullName":"mitch220","postDate":"February 20, 2012","reviewTitle":"Outstanding Experience","postReview":"As this restaurant is set on the campus of the world famous Culinary Institute of America, student chefs trade places as waiters and waitresses. The kitchen is open for guided tours as they cook your meal. The service, from host and hostess to the bar...More","starRating":"50","averageRating":0},{"fullName":"emmajr23","postDate":"February 7, 2012","reviewTitle":"everything was outstanding!","postReview":"Absolutely nothing bad to say about American Bounty.. Think it's amazing that the CIA offers students the opportunity to work in their on-campus restaurants, can't imagine a better learning experience. The food was divine, the service was spectacular, and, considering the quality of everything, it...More","starRating":"50","averageRating":0},{"fullName":"Luigierah","postDate":"January 30, 2012","reviewTitle":"I'm still smiling thinking of the waitstaff","postReview":"These young students give me hope for the future. I enjoyed their earnest, friendly attentiveness as much as I enjoyed the meal, which was fantastic. I had to admit - I had the best seat in the house that evening - facing into the \"staging...More","starRating":"50","averageRating":0},{"fullName":"TheNorsk","postDate":"January 22, 2012","reviewTitle":"Artful presentations exceptionally prepared!","postReview":"We have been going to the American Bounty and other CIA restaurants in Hyde Park for 20 years, but our most recent visit -- for a Saturday lunch -- was perhaps our best dining experience to date. Because of the snowstorm, there were relatively few...More","starRating":"50","averageRating":0},{"fullName":"Italia222","postDate":"December 22, 2011","reviewTitle":"great food, excellent service","postReview":"Delightful experience, will go back again when we are in the area. Food prepared beautifully, waitstaff does not use the terms:\"No problem\", \"You still working on that?\" nor do they call us \"guys.\" A relief.","starRating":"50","averageRating":0},{"fullName":"Helen D","postDate":"December 5, 2011","reviewTitle":"Best Food in the Hudson Valley","postReview":"In one word....AWESOME! Wonderful wine list....great appetizers.....delicious salads....perfectly cooked main courses......and 2 die 4 desserts! This restaurant has it all! Great service, too! I highly recommend visiting this restaurant if you're in the area! Hands down.....THE BEST!","starRating":"50","averageRating":0},{"fullName":"tama z","postDate":"November 29, 2011","reviewTitle":"Students strut their stuff","postReview":"We enjoyed an excellent lunch at American Bounty, on this gorgeous campus on the Hudson. Leave time to take a walk along the river and use up a few of the calories. Our student servers were charming, knowledgeable and clearly committed to making our experience...More","starRating":"50","averageRating":0},{"fullName":"black325","postDate":"November 18, 2011","reviewTitle":"Enjoyable experience","postReview":"We happened to be there for the first night of a new class of \"servers.\" Even so, the experience was memorable. I'm not much of a beef eater, but wanted something \"different\" so I ordered the short ribs in a polenta w/marscapone sauce. It was...More","starRating":"50","averageRating":0},{"fullName":"Laurel B","postDate":"November 16, 2011","reviewTitle":"Awesome food!","postReview":"You can check out the changing menus online, but the food I had on 11/11 was amazingly good. I had a butternut squash with farro, shredded romaine lettuce, and seeds that causes me to salivate just to remember it. It was paired with a wonderful...More","starRating":"50","averageRating":0},{"fullName":"JoAnnW57","postDate":"November 15, 2011","reviewTitle":"Wonderful experience","postReview":"We were visiting the area and thought it would be a shame to miss trying at least one of the restaurants at the Culinary Institute, so we chose to have dinner at American Bounty. We made a reservation for 7 pm on a Tuesday evening...More","starRating":"50","averageRating":0},{"fullName":"HungryCoupleNYC","postDate":"October 25, 2011","reviewTitle":"Wonderful experience","postReview":"The menu at the American Bounty is seasonal with a lot of emphasis on presentation. A classic beet & goat cheese salad got an updated look but retained the great classic taste and a gnocchi appetizer was perfectly flavored. An entree of fillet of beef...More","starRating":"50","averageRating":0},{"fullName":"Michael P","postDate":"October 12, 2011","reviewTitle":"Very Disappointing","postReview":"My wife and I made a reservation for 8 p.m. on a Friday night for our 16th wedding anniversary. We had previously eaten at the french CIA restaurant, which was quite good. We were seated quickly, but no one came over with water, bread or...More","starRating":"30","averageRating":0},{"fullName":"Dreamer21361","postDate":"October 10, 2011","reviewTitle":"Wonderful food","postReview":"I recently ate at the American Bounty with my husband and daughter. We found it to be an interesting experience. We made our reservation well in advance and stood in a short line with others who similar reservations to await being seated. Before long we...More","starRating":"50","averageRating":0},{"fullName":"bwco","postDate":"October 6, 2011","reviewTitle":"One of the best meals of our lives. I wish I could give it more stars","postReview":"If I could give this a 10 I would. My wife and I went here to celebrate one of those certain birthdays and we were not disappointed. The service and the meal were impeccable. I had a grilled walnut peach salad with blue cheese that...More","starRating":"50","averageRating":0},{"fullName":"LCS2468","postDate":"October 3, 2011","reviewTitle":"A real disappointment","postReview":"I had high expectations for our dinner at American Bounty. We had a very enjoyable tour of the Culinary Institute of America and the student/guide was so enthusiastic about the school that I expected our restaurant meal would be excellent. It was my husband's birthday,...More","starRating":"20","averageRating":0},{"fullName":"SabreSailor","postDate":"September 28, 2011","reviewTitle":"American Bounty - Superb!","postReview":"We had lunch at the CIA's American Bounty restaurant yesterday. It was superb. My wife had a wild mushroom soup, and the Grilled Montauk Swordfish, and I had a frisee salad and the Pan Roasted Duck Breast. Each came beautifully presented and perfectly done. You...More","starRating":"50","averageRating":0},{"fullName":"denisengarcia","postDate":"September 2, 2011","reviewTitle":"Amazing food, racist manager","postReview":"This place has an amazing menu at a pretty reasonable price. While our waitress was great, the manager ignored us the entire time. She managed to visit every table in our area except for ours. She was standing by the door when we were leaving...More","starRating":"40","averageRating":0},{"fullName":"DogenJoe","postDate":"August 25, 2011","reviewTitle":"The best pork chop I've ever had...American Bounty is a good name for this restaurant","postReview":"While this is a teaching establishment with apprentice/student cooks and servers, I found my meal of pork chops and garlic mashed potatoes to be perfectly done and super yummy. My friendly server didn't miss a beat in recommending exactly the right items for my palate....More","starRating":"40","averageRating":0},{"fullName":"Bruce154913","postDate":"August 24, 2011","reviewTitle":"Up to High Expectations","postReview":"We had high expectations based on the name 'Culinary Institute of America' at the same time we knew it was a teaching facility. The menu was varied and provided us with a wide variety of choices. Our meals were excellent and served in a most...More","starRating":"50","averageRating":0},{"fullName":"Easygoerbg","postDate":"August 14, 2011","reviewTitle":"Echoing other's reviews here","postReview":"Staffed by about to be graduates in a few days, my wife and I and great friends expected the best but were somewhat disappointed. Ate at the Apple Pie Cafe for lunch and that was very good but, dinner at the American Bounty, was a...More","starRating":"40","averageRating":0},{"fullName":"Zamborgini","postDate":"July 26, 2011","reviewTitle":"Big buildup leads to disapointment","postReview":"From what we read and friends who raved about it we had high expectations great for our meal at the CIA. Maybe our expectations were too high. After all it is a teaching kitchen manned by students. Our food was good, not great. Our servers...More","starRating":"30","averageRating":0},{"fullName":"totallyNYC","postDate":"March 17, 2011","reviewTitle":"Overhyped, Dismal Dinner","postReview":"Jumped through hoops to make a reservation for 5 on a Saturday night. Arrived on time and were seated promptly. Temperature in the restaurant was at least 80-85 degrees. Asked the waiter could the thermostat right over us be turned down, as the place was...More","starRating":"20","averageRating":0},{"fullName":"carefree_travler","postDate":"December 12, 2010","reviewTitle":"Fine food and service in a special setting.","postReview":"The restaurant is part of the Culinary Institute of America. Advanced students take turns working in the restaurant--both in food preparation and presentation, and in service--under the supervision of Staff Chefs. The physical aspects of the school in which the restaurant is located are impressive....More","starRating":"50","averageRating":0},{"fullName":"ColumbusMcK","postDate":"June 23, 2010","reviewTitle":"One of the very best meals ever!","postReview":"We ate at American Bistro. This food is out of this world!!!! There were 3 in our party, and we sampled each others dishes, so I got to try 3 appetizers, 3 entrees and 3 desserts. Everything was just FABULOUS. The server (a CIA student)...More","starRating":"50","averageRating":0},{"fullName":"MarieColorado","postDate":"June 20, 2010","reviewTitle":"Ok, not great","postReview":"Had a pastry at the Apple Pie Cafe which was very good. After tour ate at American Bounty. The food here was ok, but the service was HORRIBLE. The kid serving us was a complete snob and simply didn't want to be bothered with serving....More","starRating":"30","averageRating":0},{"fullName":"aquawaters","postDate":"October 12, 2009","reviewTitle":"What a disappointment","postReview":"We were so looking forward to our first trip to the CIA. We booked dinner reservations at American Bounty 90 days out to make sure we had a reservation. The campus is beautiful and the restaurant nice inside. The menu selection was weak - sorry...More","starRating":"30","averageRating":0},{"fullName":"JaviSanDiego","postDate":"September 2, 2009","reviewTitle":"Phenomenal food. Good deal with Fixed Price menu...but...","postReview":"Ate at the American Bounty restaurant this evening. The food was amazing. Had the three course price fixed dinner for $29 and everything was exceptional. Muscles were tender and tasty, chicken off the grill with the airline cut was so good I didn't want to...More","starRating":"50","averageRating":0},{"fullName":"wearytrvlr","postDate":"August 24, 2009","reviewTitle":"American Bounty- Great Experience 8/5/09","postReview":"We attended the American Bounty restaurant on 8/5/09 with a group of twenty Veterans Nursing Home residents, many in wheelchairs. We had made reservations in advance, and were directed to the front of the building to unload our buses. What a view! It was a...More","starRating":"50","averageRating":0},{"fullName":"G3G","postDate":"June 27, 2009","reviewTitle":"American Bounty is Best","postReview":"I've been to all of the CIA restaurants and American Bounty is my favorite. They use very fresh local and \"imported\" ingredients in excellent combinations with flair and good taste! The student wait staff is a little uneven and almost overly helpful.","starRating":"50","averageRating":0},{"fullName":"jbeckerstone","postDate":"March 16, 2009","reviewTitle":"American Bounty Disappointing","postReview":"I realize you need to be understanding that chefs and wait staff are students, but at the high price point they are using (main courses 26-29), you would expect superb food and service. We experienced decent food (some dishes quite good, and others not very...More","starRating":"20","averageRating":0},{"fullName":"A TripAdvisor reviewer on Facebook","postDate":"November 28, 2007","reviewTitle":"American Bounty is where...","postReview":"American Bounty is where it's at.","starRating":"40","averageRating":0},{"fullName":"micheleg","postDate":"April 27, 2007","reviewTitle":"Disappointing","postReview":"We ate in the American Bounty. The appetizers and desserts were great but our entrees were not good. Service was pretty good, but they brought me the wrong dessert the first time. They also didn't tell us about the option for the prix fixe. Other...More","starRating":"20","averageRating":0},{"fullName":"ADente","postDate":"March 21, 2007","reviewTitle":"American Bounty was nothing short of perfect","postReview":"From indulgant service, to excellent recomendations, to extrordinary food, to reasonable prices, it was one of the best surprises we have had in dining. A particularly nice touch was the ability to order a \"sample of soups\" and a \"flight of wines\".","starRating":"50","averageRating":0},{"fullName":"Kentuck","postDate":"October 17, 2006","reviewTitle":"American Bounty Disappointment Plus","postReview":"I had read that the Culinary Institute of America restaurants were not all they were cracked-up to be. However, one of the best-cooked meals I've had in recent memory was by a CIA graduate, in New London, New Hampshire. I told him my cousin and...More","starRating":"10","averageRating":0},{"fullName":"Jill L","postDate":"April 2, 2005","reviewTitle":"Mixed report!","postReview":"We'd do been looking forward to our dinner at the American Bounty restaurant at the CIA. I'd taken a class earlier that day and was raring to go for a delicious dinner. But I have to report a mixed experience. We were greeted warmly and...More","starRating":"20","averageRating":0}]