[{"fullName":"","postDate":"","postReview":"","starRating":"","recommendation":"","averageRating":"4.6"},{"fullName":"Mark Winter","postDate":"June 30 at 8:01 PM","postReview":"Incredible culinary experience a must do place","starRating":"","recommendation":"Mark Winter  recommends American Bounty.","averageRating":0},{"fullName":"Christine Shields Corrigan","postDate":"June 8","postReview":"My husband and another couple had lunch today at American Bounty. I will begin with the positives -- the ambience and decor of the dining room are beautiful. The menu options were creative and varied. The food that we eventually were served was excellent. My husband and I had the roasted carrot salad. We shared appetizers in lieu of an entree -- he had the terrine. I had the chicken fried quail. Our friends had cod and the cauliflower steak, as well as the pea soup. Now, here...\n\nSee More","starRating":"","recommendation":"Christine Shields Corrigan  doesn't recommend American Bounty.","averageRating":0},{"fullName":"Barbara Kay Koontharana","postDate":"May 18","postReview":"My son and I loved eating at American Bounty. The food was wonderful with some things the best I’ve ever tasted, the duck terrine in the charcuterie appetiser, the pork loin entree, the butter with the rolls. Wow! And can’t forget the local Baco Noir wine and the dessert sorbets!","starRating":"","recommendation":"Barbara Kay Koontharana  recommends American Bounty.","averageRating":0},{"fullName":"Alex Susskind","postDate":"16 hrs","postReview":"As a graduate of CIA I was so happy to be back visiting. It made me proud to see the excellence and pride that emerged from the students. So much that I contacted a friend I graduated with. We will be visiting again soon. A truly amazing restaurant.","starRating":"","recommendation":"Alex Susskind  recommends American Bounty.","averageRating":0},{"fullName":"Francis Faulkner","postDate":"April 30","postReview":"Excellent meal, good service, very informative server.","starRating":"","recommendation":"Francis Faulkner  recommends American Bounty.","averageRating":0},{"fullName":"Beth Wallick White","postDate":"April 26","postReview":"Absolutely the best place for an occasion to visit with friends over a even paced, delicious meal","starRating":"","recommendation":"Beth Wallick White  recommends American Bounty.","averageRating":0},{"fullName":"Jane E. Barg Alsdorf","postDate":"April 26","postReview":"Awesome food great company. Students rock","starRating":"","recommendation":"Jane E. Barg Alsdorf  recommends American Bounty.","averageRating":0},{"fullName":"Louise Feldman","postDate":"April 14, 2017","postReview":"This place is superb! For a Start the setting is beautiful. The CIA campus is beautiful but where the restaurants are is so pretty with a pavilion and water feature outside. The entrance is very grand with a long hallway leading to the various restaurants. American bounty itself has a bar at the entrance which would be good if you arrive early or have to wait for your table for some reason. Luckily we did not have to wait and were taken to our table even though we arrived al...\n\nSee More","starRating":"5 star","recommendation":"Louise Feldman reviewed American Bounty — \n5 star","averageRating":0},{"fullName":"Michael Golub","postDate":"February 21","postReview":"Excellent service and fantastic dinner","starRating":"","recommendation":"Michael Golub  recommends American Bounty.","averageRating":0},{"fullName":"Jessica Joy Smith","postDate":"May 16, 2017","postReview":"Had potential but service wasn't great. Went with my Mom and Grandma the day before Mother's Day for lunch. Took over 30 minutes for a server to even take our order and bring us drinks. They wouldnt have brought us bread if we didnt ask them. Forgot part of our appetizers and brought it with our entrees. Grandma's duck was very fatty and rarer than she expected and when she asked for the fat to be cooked down it was barely re-seared. I know the students are learning but I'm comparing it to other Culinary campus restaurants and we had a much better experience at Bocuse. I expected a better experience.","starRating":"","recommendation":"Jessica Joy Smith reviewed American Bounty — \n3 star","averageRating":0},{"fullName":"Elizabeth Pfeufer Knapp","postDate":"January 24","postReview":"Food was great! Service was great! Highly recommend!!!!👍👍👍👍👍","starRating":"","recommendation":"Elizabeth Pfeufer Knapp  recommends American Bounty.","averageRating":0},{"fullName":"Marlene Levin","postDate":"May 3, 2017","postReview":"Was with a bus group for lunch. The food was excellent. We had scallops. Just wonderful. Being in a group, we had to sit at seperate tables, with people who were not friends or family. The student who was helping with seating never smiled and was not helpful at all. Her personality should not be in Customer Service at all. She did not know how to deal with people. I hope she chooses back of house for her career path. But the food? Outstanding. Our young girl, student, who served our table was excellent. I feel with bus groups they could know ahead of time the number of people in each group and accommodate people so they can sit with friends and family, not strangers.","starRating":"5 star","recommendation":"Marlene Levin reviewed American Bounty — \n5 star","averageRating":0},{"fullName":"Pat Port","postDate":"November 20, 2018","postReview":"Excellent meals were enjoyed by five of us celebrating my granddaughter’s birthday! And out server, Jason, was great. And we got a picture with Michael, the head pastry chef.","starRating":"","recommendation":"Pat Port  recommends American Bounty.","averageRating":0},{"fullName":"Wendell Choinsky","postDate":"March 17, 2018","postReview":"The food was excellent but I was surprisingly disappointed with their 3 beers. The extra pale was far too hopped for style. The wit also was far too hopped for style and lacked the smooth mouthfeel indicative of contemporaries like Celis. The IPA was the best of the 3 but should have had more malt balance.","starRating":"","recommendation":"Wendell Choinsky reviewed American Bounty — \n4 star","averageRating":0},{"fullName":"Ciara Breckenridge","postDate":"February 15","postReview":"It was amazing , this is my 5th time going there.","starRating":"","recommendation":"Ciara Breckenridge  recommends American Bounty.","averageRating":0},{"fullName":"Steve St Lucia","postDate":"April 11, 2016","postReview":"Our family and friends ate at the American Bounty on Saturday, April 9th. I wanted to wait a few days to see if my impression of the food changed even a tiny bit but it hasn't. I did not ask anyone else at the table about their opinion but no one offered any positive comments regarding their meal. So, this review is my experience solely. I had Roasted Oysters (appetizer), Bison (main course), Coconut Custard (dessert). The Bison was small, cooked as I ordered but not flavo...\n\nSee More","starRating":"","recommendation":"Steve St Lucia reviewed American Bounty — \n1 star","averageRating":0},{"fullName":"Michelle Huguenin Perla","postDate":"August 25, 2018","postReview":"They have the best French fries and the biscuit and honey butter is to die for! The wait staff was very attentive.","starRating":"","recommendation":"Michelle Huguenin Perla  recommends American Bounty.","averageRating":0},{"fullName":"Lora Weiss","postDate":"June 16, 2018","postReview":"Service was excellent; Pinot noir was very good; lamb chops tasty and seasoned well, although arrived medium well, not the medium rare I ordered. Surprised at that. Everything else was “spot on”. Such a wonderful dining experience!","starRating":"","recommendation":"Lora Weiss reviewed American Bounty — \n4 star","averageRating":0},{"fullName":"Dennis Tompkins","postDate":"May 12, 2018","postReview":"This was my first visit to the culinary and the staff knocked it out of the park. From the service to the taste of the meal ( including dessert ) it was excellent. We will be back. Best of luck to this class of students in the future.","starRating":"","recommendation":"Dennis Tompkins  recommends American Bounty.","averageRating":0},{"fullName":"Kathy Doyle","postDate":"September 27, 2015","postReview":"We went with dear friends, there seemed to be no adult supervision; all the students working were talking to each other more than attending the customers. I ordered my steak medium; pink on the inside, it came out raw; purple in color, finally when our young waiter returned, the other three people at my table were almost done with their meal, I asked for it to be cooked to medium, fifteen minutes later the steak was returned exactly as raw as it had been the first time. I then asked for it to go, along with my onion rings. After receiving a ticket to go down a hallway to get my leftovers; only then to find my onion rings missing. A very expensive disappointing experience.","starRating":"","recommendation":"Kathy Doyle reviewed American Bounty — \n2 star","averageRating":0},{"fullName":"Michael Law","postDate":"January 31, 2018","postReview":"Do not pass on the opportunity to eat at American Bounty. Whatever the menu, it will not disappoint . I had the catfish. Melted in my mouth. Two thumbs up.","starRating":"5 star","recommendation":"Michael Law reviewed American Bounty — \n5 star","averageRating":0},{"fullName":"Andrew Korchma","postDate":"June 17, 2017","postReview":"Might be the worst dining experience I've ever had. Don't go in hungry, you will leave hungrier. Top prices, tiny portions and terrible service. Got the check and they over charged on drinks we didn't get. The students should be asking for their tuition back. Run from this place!","starRating":"","recommendation":"Andrew Korchma reviewed American Bounty — \n1 star","averageRating":0},{"fullName":"Catherine Haight","postDate":"July 9, 2015","postReview":"We thoroughly enjoy the experience at the restaurant ! Everyone from the maitre'd to the hostess and our waiter Will were incredible . We were sat near the kitchen so my daughter who will be attending in January could watch the students in action, and the food we had was delicious. Thank you Culinary Institute for making this a memorable time. I can't wait to return and see my baby in uniform do what you all do so well.","starRating":"5 star","recommendation":"Catherine Haight reviewed American Bounty — \n5 star","averageRating":0},{"fullName":"Debbie Yaniga","postDate":"March 10, 2016","postReview":"Selected American Bounty for dinner for my Birthday. We had made a reservation 4 weeks in advance, and unfortunately, received a call that they had a party booked that evening. However, not only did they reschedule, they put us in for a Saturday night which we could not get originally and comp'd our desert. The food was absolutely fabulous and the service could not be better","starRating":"5 star","recommendation":"Debbie Yaniga reviewed American Bounty — \n5 star","averageRating":0},{"fullName":"Michele Vetre Camarero","postDate":"August 26, 2018","postReview":"Have been to all the CIA restaurants in New York ,and have to say disappointed in this one. Hard rice,under seasoned meals. Service was good.","starRating":"","recommendation":"Michele Vetre Camarero reviewed American Bounty — \n3 star","averageRating":0},{"fullName":"Jay Passarella","postDate":"June 18, 2018","postReview":"Loved it. Great farm to table with staff that exceeds expectations. 2 hour drive for me but worth the trip.","starRating":"5 star","recommendation":"Jay Passarella reviewed American Bounty — \n5 star","averageRating":0},{"fullName":"Kim Lunn Busche","postDate":"November 20, 2016","postReview":"My son and I sent for college tour. We had lunch at the tavern. He had the duck confit and I had the mussels. We sat at the bar . The food was wonderful and the bartender was lovely , kept chatting with us . Great experience","starRating":"5 star","recommendation":"Kim Lunn Busche reviewed American Bounty — \n5 star","averageRating":0},{"fullName":"J Virgil Edwards","postDate":"March 1, 2017","postReview":"If the service, menu, food, wine list and welcoming, but elegant atmosphere at American Bounty are any indication, the future of the culinary arts is in good hands with the next generation of young professionals passing through this very special dining room on the banks of the Hudson.","starRating":"5 star","recommendation":"J Virgil Edwards reviewed American Bounty — \n5 star","averageRating":0},{"fullName":"Bakari Adeyemi","postDate":"September 24, 2016","postReview":"Great restaurant to get dressed up and celebrate a special occasion... Quality food and service at the Culinary Institute of America.... Birthday, first date, etc. Nice place to enjoy the finer things in life!","starRating":"5 star","recommendation":"Bakari Adeyemi reviewed American Bounty — \n5 star","averageRating":0},{"fullName":"Gloria Sorrentino Fiore","postDate":"November 4, 2017","postReview":"American Bounty at the CIA is a wonderful dining experience! The Lamb and Duck prepared to perfection ... Apps, entrée and dessert ...delicious with stellar presentation!! :-) ... Restaurant week ...such a nice treat !!! :-)","starRating":"5 star","recommendation":"Gloria Sorrentino Fiore reviewed American Bounty — \n5 star","averageRating":0}]